[
    {
        "title":"BlackRock Enhances Sustainability Characteristics of $92 Billion of Funds Ahead of ESMA ESG Fund Naming Rules",
        "date":"March 19, 2025",
        "link":"https:\/\/www.esgtoday.com\/blackrock-enhances-sustainability-characteristics-of-92-billion-of-funds-ahead-of-esma-esg-fund-naming-rules\/",
        "excerpt":"Investment giant BlackRock announced a series of changes to its sustainable fund lineup ahead of […]",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"blackrock",
        "categories":[

        ],
        "full_content":"Investment giant BlackRock announced a series of changes to its sustainable fund lineup ahead of the implementation of new fund naming guidelines by EU markets regulator the European Securities and Markets Authority (ESMA), according to a letter to BlackRock clients seen by ESG Today.\nBlackRock’s platform includes more than 500 sustainable and transition investment strategies, and the firm manages over $1 trillion of sustainable and transition assets for clients. The changes will apply to 135 funds, representing approximately $185 billion in AUM, and will include enhancing sustainability characteristics for some funds, implementing a stronger transition focus for some, and removing sustainability-related terms from others.\nNotably, for funds dropping their ESG terms, BlackRock said that investment strategies, including sustainability characteristics, will remain unchanged.\nThe changes follow the release in May 2024 by ESMA of its finalized guidelines for the use of ESG and sustainability-related terms in investment fund names. ESMA launched the new rules after noting a sharp increase in the use of sustainability-related terms in fund names in Europe over the past several years, leading to an increased risk of greenwashing.\nUnder the new guidelines, funds using ESG, sustainability, or impact terms, or environmental terms such as “green,” “environmental,” or “climate,” will be required to meet investment thresholds including having at least 80% of assets in investments used to meet the sustainability characteristics of the fund, and to follow the exclusion criteria for Paris Aligned Benchmarks (PABs). PAB exclusions include companies with more than 10% of revenue from oil production or refining, 1% from coal, or 50% from gas fuels production, those with most revenues coming from emissions-intensive energy generation, as well as those involved in controversial weapons, production of tobacco.\nThe new guidelines also introduced a “transition” category, which includes funds labeled with terms such as “improving,” “progress,” “evolution,” and “transformation.” The transition category also includes an 80% investment threshold, while applying exclusions from the EU’s rules for Climate Transition Benchmarks (CTBs), instead of the more stringent PABs, in order to enable investment in companies deriving part of their revenues from fossil fuels.\nThe new guidelines come into effect on May 21, 2025. A recent study found that as many as two-thirds of funds in the EU labelled with sustainable or ESG-related terms may need to sell assets or change their names to align with new the new guidelines.\nBlackRock said that the updates to its European product range were made following consultations with a significant number of clients including large distributors, product selectors and portfolio managers.\nAmong the changes, BlackRock said that 60 funds, representing $92 billion of client AUM will enhance their sustainability characteristics, with specific changes to some including adding the PAB exclusions. 18 funds, representing $42 billion of AUM will have new transition-related terms added to their names or will adjust investment methodologies to align with transition investing objectives, while 56 funds, representing $51 billion of AUM will have sustainability-related terms removed from their names. BlackRock added that one fund will be reclassified from Article 8 to Article 6 under the SFDR regulation, while all other Article 8 or 9 funds will maintain their classifications.",
        "mention_count":7,
        "relevant_paragraphs":[
            "Investment giant BlackRock announced a series of changes to its sustainable fund lineup ahead of the implementation of new fund naming guidelines by EU markets regulator the European Securities and Markets Authority (ESMA), according to a letter to BlackRock clients seen by ESG Today.",
            "BlackRock’s platform includes more than 500 sustainable and transition investment strategies, and the firm manages over $1 trillion of sustainable and transition assets for clients. The changes will apply to 135 funds, representing approximately $185 billion in AUM, and will include enhancing sustainability characteristics for some funds, implementing a stronger transition focus for some, and removing sustainability-related terms from others.",
            "Notably, for funds dropping their ESG terms, BlackRock said that investment strategies, including sustainability characteristics, will remain unchanged.",
            "BlackRock said that the updates to its European product range were made following consultations with a significant number of clients including large distributors, product selectors and portfolio managers.",
            "Among the changes, BlackRock said that 60 funds, representing $92 billion of client AUM will enhance their sustainability characteristics, with specific changes to some including adding the PAB exclusions. 18 funds, representing $42 billion of AUM will have new transition-related terms added to their names or will adjust investment methodologies to align with transition investing objectives, while 56 funds, representing $51 billion of AUM will have sustainability-related terms removed from their names. BlackRock added that one fund will be reclassified from Article 8 to Article 6 under the SFDR regulation, while all other Article 8 or 9 funds will maintain their classifications."
        ],
        "esg_theme_counts":{
            "environmental":8,
            "social":0,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "green",
                "emissions",
                "climate",
                "sustainable"
            ],
            "social":[

            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":0.6,
        "sentiment":"positive",
        "positive_words":4,
        "negative_words":1,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"BlackRock: Growing AI Power Demand to Continue Driving Energy Transition Opportunities",
        "date":"February 25, 2025",
        "link":"https:\/\/www.esgtoday.com\/blackrock-growing-ai-power-demand-to-continue-driving-energy-transition-opportunities\/",
        "excerpt":"Expanding power needs driven by the ongoing growth in AI, alongside other structural shifts such […]",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"blackrock",
        "categories":[

        ],
        "full_content":"Expanding power needs driven by the ongoing growth in AI, alongside other structural shifts such as electrification, will continue to create investment opportunities in the infrastructure and utilities sectors, and even further growth in energy transition investment, according to a new report released by the BlackRock Investment Institute.\nThe report forecasts that the power demand for AI will continue to grow even with the emergence of more efficient AI models, such as the recently introduced DeepSeek, anticipating instead that significant investment will be required to enable “new frontiers,” such as “artificial general intelligence that matches or surpasses human abilities.”\nAccording to the report, even after the DeepSeek news hit the market, major technology players announced plans to significantly grow AI spend, with current company guidance indicating that “Meta, Amazon, Microsoft and Alphabet are expected to invest nearly $320 billion in AI capex this year, up roughly 40% from 2024.”\nWith the growth in AI, alongside other factors such as rising global incomes, industrial growth and electrification of buildings and vehicles, driving rising power demand, BlackRock forecasts that “already huge investment expected in the energy transition could grow further, in our view,” particularly as “the companies driving the AI buildout prefer power supplies that are always on, cost-effective, immediately available and low carbon, a difficult combination,” which could drive demand for natural gas and renewables.\nWhile the report sees a continued role for traditional energy as policymakers address needs for affordable and reliable power, BlackRock adds that “longer term, demand could rise for nuclear and other low-carbon, available-when-needed energy sources.”\nClick here to access the report.",
        "mention_count":3,
        "relevant_paragraphs":[
            "Expanding power needs driven by the ongoing growth in AI, alongside other structural shifts such as electrification, will continue to create investment opportunities in the infrastructure and utilities sectors, and even further growth in energy transition investment, according to a new report released by the BlackRock Investment Institute.",
            "With the growth in AI, alongside other factors such as rising global incomes, industrial growth and electrification of buildings and vehicles, driving rising power demand, BlackRock forecasts that “already huge investment expected in the energy transition could grow further, in our view,” particularly as “the companies driving the AI buildout prefer power supplies that are always on, cost-effective, immediately available and low carbon, a difficult combination,” which could drive demand for natural gas and renewables.",
            "While the report sees a continued role for traditional energy as policymakers address needs for affordable and reliable power, BlackRock adds that “longer term, demand could rise for nuclear and other low-carbon, available-when-needed energy sources.”"
        ],
        "esg_theme_counts":{
            "environmental":2,
            "social":0,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "carbon"
            ],
            "social":[

            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":1.0,
        "sentiment":"positive",
        "positive_words":4,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"BlackRock Appoints Louise Kooy-Henckel as EMEA Head of Sustainable and Transition Solutions",
        "date":"February 14, 2025",
        "link":"https:\/\/www.esgtoday.com\/blackrock-appoints-louise-kooy-henckel-as-emea-head-of-sustainable-and-transition-solutions\/",
        "excerpt":"Investment giant BlackRock announced today the appointment of Louise Kooy-Henckel as EMEA Head of Sustainable […]",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"blackrock",
        "categories":[

        ],
        "full_content":"Investment giant BlackRock announced today the appointment of Louise Kooy-Henckel as EMEA Head of Sustainable and Transition Solutions.\nBased in London and reporting to Global Head of STS Helen Lees-Jones, responsible for leading the firm’s efforts in sustainable and transition investing in the EMEA region.\nIn an internal memo announcing the appointment, Lees-Jones and Stephen Cohen, Chief Product Officer at BlackRock, said:\n“We are delighted that Louise Kooy-Henckel joins BlackRock as EMEA Head of Sustainable and Transition Solutions (STS) to lead the team and our growth in a region where client demand for sustainable and transition investing is greatest. 100% of our largest client relationships in Europe have made net zero commitments for their organizations.”\nPrior to joining BlackRock, Kooy-Henckel served as Managing Director and Investment Director, Sustainable and Impact Investments, EMEA at Wellington Management, responsible for leading ESG research and integration, impact investing, climate, and long-term engagement strategies, and for oversight of portfolio positioning, performance, and risk exposures for the firm’s impact investment approaches. Before joining Wellington Management, she spent nearly 20 years at JPMorgan Asset Management, including serving as head of the Global Equities client portfolio management team.\nBlackRock’s platform includes more than 500 sustainable and transition investment strategies, and the firm manages over $1 trillion of sustainable and transition assets for clients.\nLees-Jones and Cohen added:\n“STS continues to drive commercial strategy, shape our sustainable and transition product range and partner across the firm to deliver investment insights on topics such as the energy transition, physical climate risks and resilience.”",
        "mention_count":5,
        "relevant_paragraphs":[
            "Investment giant BlackRock announced today the appointment of Louise Kooy-Henckel as EMEA Head of Sustainable and Transition Solutions.",
            "In an internal memo announcing the appointment, Lees-Jones and Stephen Cohen, Chief Product Officer at BlackRock, said:",
            "“We are delighted that Louise Kooy-Henckel joins BlackRock as EMEA Head of Sustainable and Transition Solutions (STS) to lead the team and our growth in a region where client demand for sustainable and transition investing is greatest. 100% of our largest client relationships in Europe have made net zero commitments for their organizations.”",
            "Prior to joining BlackRock, Kooy-Henckel served as Managing Director and Investment Director, Sustainable and Impact Investments, EMEA at Wellington Management, responsible for leading ESG research and integration, impact investing, climate, and long-term engagement strategies, and for oversight of portfolio positioning, performance, and risk exposures for the firm’s impact investment approaches. Before joining Wellington Management, she spent nearly 20 years at JPMorgan Asset Management, including serving as head of the Global Equities client portfolio management team.",
            "BlackRock’s platform includes more than 500 sustainable and transition investment strategies, and the firm manages over $1 trillion of sustainable and transition assets for clients."
        ],
        "esg_theme_counts":{
            "environmental":11,
            "social":0,
            "governance":1
        },
        "esg_keywords":{
            "environmental":[
                "net zero",
                "climate",
                "sustainable"
            ],
            "social":[

            ],
            "governance":[
                "oversight"
            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":1,
        "sustainable_finance_keywords":[
            "impact investing"
        ],
        "sustainable_finance_focus":false,
        "sentiment_score":0.83,
        "sentiment":"positive",
        "positive_words":11,
        "negative_words":1,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"Texas-Led Multi-State Coalition Threatens BlackRock, Goldman Sachs, JPMorgan and Others with Legal Action Over ESG Commitments",
        "date":"January 28, 2025",
        "link":"https:\/\/www.esgtoday.com\/texas-led-multi-state-coalition-threatens-blackrock-goldman-sachs-jpmorgan-and-others-with-legal-action-over-esg-commitments\/",
        "excerpt":"Texas Attorney General Ken Paxton announced that he has sent a letter to BlackRock, Goldman […]",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"blackrock",
        "categories":[

        ],
        "full_content":"Texas Attorney General Ken Paxton announced that he has sent a letter to BlackRock, Goldman Sachs, JPMorgan Chase, Bank of America, Citigroup, and Morgan Stanley warning the Wall Street firms of potential legal actions over their diversity and climate investing policies and practices.\nThe letter was co-signed by 9 other state Attorneys General, including the AGs of Alabama, Idaho, Indiana, Iowa, Montana, Nebraska, South Carolina, Utah and Virginia.\nThe letter marks the latest move in an ongoing anti-ESG and DEI campaign by Republican politicians in the U.S. over the past few years, which has gained momentum since the election of Donald Trump. Texas has been one of the most active states in anti-ESG initiatives, with actions including having several asset managers placed on a list for potential divestment for allegedly “boycotting” energy companies, and more recently launching a multi-state lawsuit against BlackRock, Vanguard and State Street, accusing the asset managers of using their positions in climate-focused investment initiatives to manipulate energy markets.\nIn the weeks following the election, each of the firms targeted by the new letter announced withdrawals from climate-focused investment and finance coalitions, including the Net-Zero Banking Association (NZBA) and the Net Zero Asset Managers (NZAM) initiative.\nWhile the letter states that the AGs “applaud you for terminating your relationships” with the NZBA, NZAM and climate-focused engagement network Climate Action 100+ (CA100+), the AGs added that “we still want answers” to decisions made by the firms while they were members of the groups, and accused the firms of potential legal violations through their support for net zero-focused shareholder resolutions and engagement practices.\nThe letter added that statements made by some of the firms reiterating their net zero commitments after leaving the groups “raise serious concerns as to whether your exodus is an optics-only effort.”\nThe letter also warns the firms of potential legal actions related to their DEI policies, including “discriminatory employment quotas,” such as BlackRock’s use of DEI goals in employee performance reviews and bonus considerations, “discriminatory board quotas,” citing BlackRock’s proxy voting guideline that encourages large companies to have boards with “at least two women and a director who identifies as a member of an underrepresented group” as an example, and “discriminatory supplier quotas,” such as Goldman Sachs’ goal to “spend a cumulative $1.5 billion with small and diverse vendors between 2023 and 2025.”\nThe letter includes a series of questions for each firm regarding their ESG and DEI policies, requesting responses within 45 days as an “opportunity to avoid a lengthy enforcement action,” and to “demonstrate whether violations have occurred, whether they will continue, and the necessity of enforcement actions to vindicate federal or State laws.”\nIn a statement released alongside the letter, Texas AG Paxton said:\n“Banks and financial institutions are finally starting to realize that the ESG and DEI policies pushed by radical activist groups are bad for consumers and potentially violate the law. Unlawful race- and sex-based quotas and so-called ‘green energy’ schemes will not be allowed to stand and I will continue to urge these organizations to uphold the legal obligations they owe to consumers and investors. Any institution found to be violating the law will be held accountable.”\nClick here to access the letter.",
        "mention_count":4,
        "relevant_paragraphs":[
            "Texas Attorney General Ken Paxton announced that he has sent a letter to BlackRock, Goldman Sachs, JPMorgan Chase, Bank of America, Citigroup, and Morgan Stanley warning the Wall Street firms of potential legal actions over their diversity and climate investing policies and practices.",
            "The letter marks the latest move in an ongoing anti-ESG and DEI campaign by Republican politicians in the U.S. over the past few years, which has gained momentum since the election of Donald Trump. Texas has been one of the most active states in anti-ESG initiatives, with actions including having several asset managers placed on a list for potential divestment for allegedly “boycotting” energy companies, and more recently launching a multi-state lawsuit against BlackRock, Vanguard and State Street, accusing the asset managers of using their positions in climate-focused investment initiatives to manipulate energy markets.",
            "The letter also warns the firms of potential legal actions related to their DEI policies, including “discriminatory employment quotas,” such as BlackRock’s use of DEI goals in employee performance reviews and bonus considerations, “discriminatory board quotas,” citing BlackRock’s proxy voting guideline that encourages large companies to have boards with “at least two women and a director who identifies as a member of an underrepresented group” as an example, and “discriminatory supplier quotas,” such as Goldman Sachs’ goal to “spend a cumulative $1.5 billion with small and diverse vendors between 2023 and 2025.”"
        ],
        "esg_theme_counts":{
            "environmental":9,
            "social":7,
            "governance":3
        },
        "esg_keywords":{
            "environmental":[
                "green",
                "net zero",
                "climate"
            ],
            "social":[
                "dei",
                "diversity",
                "employee"
            ],
            "governance":[
                "voting",
                "shareholder",
                "board"
            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":-1.0,
        "sentiment":"negative",
        "positive_words":0,
        "negative_words":1,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"BlackRock Launches First Fund Using FCA’s “Sustainability Improvers” Label Targeting Brown-to-Green Materials Opportunities",
        "date":"January 27, 2025",
        "link":"https:\/\/www.esgtoday.com\/blackrock-launches-first-fund-using-fcas-sustainability-improvers-label-targeting-brown-to-green-materials-opportunities\/",
        "excerpt":"Investment giant BlackRock announced the launch of the BlackRock BFM Brown to Green Materials Fund […]",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"blackrock",
        "categories":[

        ],
        "full_content":"Investment giant BlackRock announced the launch of the BlackRock BFM Brown to Green Materials Fund for UK investors, a new fund aimed at targeting overlooked opportunities stemming from the transition to a low carbon economy in the materials sector.\nThe launch marks the first UK domiciled mutual fund to use the new “Sustainability Improvers” label introduced by the UK Financial Conduct Authority (FCA)’s Sustainability Disclosure Requirements (SDR).\nThe new fund builds on a similar strategy to BlackRock’s BGF Brown to Green Materials Fund launched for European investors in 2023. The new fund will be managed by Evy Hambro, Olivia Markham and Hannah Johnson, who also manage the BGF Brown to Green Materials Fund.\nHambro said:\n“This strategy has been designed to provide clients with exposure to the Brown to Green Materials theme, recognising that what could drive share prices from here, and what could make a positive difference to the world, is what happens moving forward rather than what’s already happened.”\nAccording to BlackRock, the funds come as a number of sectors, beyond renewables, stand to benefit from the transition to a low-carbon economy, but may have been overlooked by investors, creating attractive investment opportunities. The new fund will invest in companies related to materials that are essential for the low carbon transition and opportunities created by decarbonizing materials supply.\nHambro added:\n“We are targeting what we believe to be an overlooked segment of the value chain for lower carbon technologies. Companies which are high emitters today, but that have credible plans to decarbonise, could offer a significant investment opportunity. As the theme broadens out even further, these companies leading emissions intensity reduction efforts in their industries could benefit from a first mover advantage as the lowcarbon materials market develops.”\nBlackRock said that it anticipates that companies in the decarbonizing industries in the materials sector – including metals and mining, cement, chemicals, steel, and construction materials industries – stand to benefit as their sustainability risks decrease, leading to higher multiples, lower operational costs, and lower decarbonization capital requirements relative to their higher carbon peers.\nMarkham said:\n“Materials companies that best navigate the ‘Brown to Green’ transition could benefit from a re-rating in the valuation multiples the market is willing to pay for them. We expect global adoption of lower carbon technologies will drive stronger-than expected demand growth for materials required faster than anticipated, and this will result in higher materials prices and better-than-expected earnings for producers.”\nThe FCA’s SDR requirements were  introduced by the regulator to help investors assess the sustainability attributes of investment products, and to avoid greenwashing risk, to portfolio managers. The SDR included naming and marketing rules for investment products, requiring that sustainability-related terms can only be used in product names and marketing if a label is used.\nThe FCA rules introduce four labels intended to help consumers to differentiate between the sustainability objectives and investment approaches of investment products. These include Sustainability Focus, for products that aim to invest in assets that are environmentally and socially sustainable; Sustainability Improvers, investing in assets that have the potential to improve environmental and\/or social sustainability over time; Sustainability Impact, investing with an aim to achieve a predefined positive and measurable environmental or social impact, and; Sustainability Mixed Goals, a newly introduced category for funds that invest across different sustainability objectives and strategies aligned with the other categories. The rules include a series of criteria for products to use the labels, including a requirement for at least 70% of the products assets to ordinarily be invested in line with the label’s objective, as well as ongoing product-level disclosures for products using a label.\nBlackRock said that the new fund will utilize the firm’s proprietary “SDR Improver Assessment” methodology to assess companies that it invests in, ensuring that it meets the regulation’s 70% threshold for the use of the Sustainability Improvers label.",
        "mention_count":6,
        "relevant_paragraphs":[
            "Investment giant BlackRock announced the launch of the BlackRock BFM Brown to Green Materials Fund for UK investors, a new fund aimed at targeting overlooked opportunities stemming from the transition to a low carbon economy in the materials sector.",
            "The new fund builds on a similar strategy to BlackRock’s BGF Brown to Green Materials Fund launched for European investors in 2023. The new fund will be managed by Evy Hambro, Olivia Markham and Hannah Johnson, who also manage the BGF Brown to Green Materials Fund.",
            "According to BlackRock, the funds come as a number of sectors, beyond renewables, stand to benefit from the transition to a low-carbon economy, but may have been overlooked by investors, creating attractive investment opportunities. The new fund will invest in companies related to materials that are essential for the low carbon transition and opportunities created by decarbonizing materials supply.",
            "BlackRock said that it anticipates that companies in the decarbonizing industries in the materials sector – including metals and mining, cement, chemicals, steel, and construction materials industries – stand to benefit as their sustainability risks decrease, leading to higher multiples, lower operational costs, and lower decarbonization capital requirements relative to their higher carbon peers.",
            "BlackRock said that the new fund will utilize the firm’s proprietary “SDR Improver Assessment” methodology to assess companies that it invests in, ensuring that it meets the regulation’s 70% threshold for the use of the Sustainability Improvers label."
        ],
        "esg_theme_counts":{
            "environmental":13,
            "social":1,
            "governance":1
        },
        "esg_keywords":{
            "environmental":[
                "green",
                "carbon",
                "sustainable",
                "emissions"
            ],
            "social":[
                "social impact"
            ],
            "governance":[
                "disclosure"
            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":0.8,
        "sentiment":"positive",
        "positive_words":9,
        "negative_words":1,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"BlackRock, Temasek Decarbonization Fund Invests in Energy Transition Software Provider Orennia",
        "date":"January 22, 2025",
        "link":"https:\/\/www.esgtoday.com\/blackrock-temasek-decarbonization-fund-invests-in-energy-transition-software-provider-orennia\/",
        "excerpt":"Energy transition data and analytics company Orennia announced the closing of its Series C growth […]",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"blackrock",
        "categories":[

        ],
        "full_content":"Energy transition data and analytics company Orennia announced the closing of its Series C growth financing round. The round was led by BlackRock and Temasek’s decarbonization-focused fund, Decarbonization Partners, and follows a $25 million Series B financing by the company in July 2023.\nLaunched in 2021, Calgary-based Orennia provides a software platform for energy transition developers and investors, aimed at enabling them to make informed decisions, manage risk, and increase returns. The company’s AI-powered platform, Ion_AI provides users with data, analytics and research to help inform capital allocation decisions across the renewables, storage, clean fuels and decarbonization sectors, including power, renewables, data centers, clean fuels and carbon capture.\nBrook Papau, CEO and co-founder of Orennia, said:\n“In an industry where many technology providers fall short of their claims, we are proud to stand out as a leader. This investment underscores the real, actionable value Orennia brings its clients. Our platform provides a durable strategic edge that’s redefining what’s possible in the energy transition. We are relentless supporters of our clients, and it shows: 95% say we’re accelerating their workflows, and 93% say we’re helping them make better capital-allocation decisions.”\nDecarbonization Partners, which led the funding round, was launched by BlackRock and Temasek in 2022, establishing a late-stage venture capital and growth private equity partnership to invest in companies providing technologies and solutions that help accelerate the transition to a net zero economy by 2050. The new financing round also included participation from existing investors.\nDr. Meghan Sharp, Global Head and Chief Investment Officer of Decarbonization Partners, said:\n“Orennia’s market leading software platform is a prime example of how digital technologies can enable significant decarbonization outcomes across a diverse group of blue-chip customers. Developers and investors across the energy transition space require trustworthy data, analytics and insights. Orennia’s platform allows market participants to make timely and confident investment decisions that deliver proven results and accelerate projects.”",
        "mention_count":2,
        "relevant_paragraphs":[
            "Energy transition data and analytics company Orennia announced the closing of its Series C growth financing round. The round was led by BlackRock and Temasek’s decarbonization-focused fund, Decarbonization Partners, and follows a $25 million Series B financing by the company in July 2023.",
            "Decarbonization Partners, which led the funding round, was launched by BlackRock and Temasek in 2022, establishing a late-stage venture capital and growth private equity partnership to invest in companies providing technologies and solutions that help accelerate the transition to a net zero economy by 2050. The new financing round also included participation from existing investors."
        ],
        "esg_theme_counts":{
            "environmental":2,
            "social":1,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "carbon",
                "net zero"
            ],
            "social":[
                "equity"
            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":1.0,
        "sentiment":"positive",
        "positive_words":3,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"Net Zero Investor Coalition Hits Pause After BlackRock Exit",
        "date":"January 14, 2025",
        "link":"https:\/\/www.esgtoday.com\/net-zero-investor-coalition-hits-pause-after-blackrock-exit\/",
        "excerpt":"The Net Zero Asset Managers (NZAM) initiative, a major multi-trillion dollar group of investment managers […]",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"blackrock",
        "categories":[

        ],
        "full_content":"The Net Zero Asset Managers (NZAM) initiative, a major multi-trillion dollar group of investment managers committed to supporting the goal of net zero greenhouse gas emissions by 2050, announced that it will suspend its primary activities, as it moves to adapt to a changing political and regulatory environment.\nThe move follows an announcement by BlackRock, the largest global investment management company, and an early NZAM signatory, that it had decided to leave the group, in a letter to clients that said that its membership in the coalition “caused confusion regarding BlackRock’s practices and subjected us to legal inquiries from various public officials.”\nThe move may also be aimed at staving off a repeat of a rapid exodus experienced by NZAM’s sister coalition, the Net-Zero Banking Alliance (NZBA), which saw all major U.S. banks leave within a month, following the initial exit of Goldman Sachs in early December.\nThe flood of departures from the net zero coalitions comes in the context of the upcoming inauguration of Donald Trump, and following years of pressure on financial services participants in the groups from a vocal anti-ESG movement by Republican politicians in the U.S., with claims that participation in the climate initiatives amounted to “boycotting energy companies,” or various forms of collusive or anti-competitive behaviors, or that they were not in the best fiduciary interests of clients.\nIn a statement announcing the move, NZAM said:\n“Recent developments in the U.S. and different regulatory and client expectations in investors’ respective jurisdictions have led to NZAM launching a review of the initiative to ensure NZAM remains fit for purpose in the new global context. “\nNZAM was launched in December 2020 with a group of 30 asset managers representing approximately $9 trillion of assets under management (AUM), and by early 2025 included more than 325 signatories and over $57 trillion in AUM.\nSignatories to NZAM agreed to a series of commitments aimed at supporting the goal of net zero GHG emissions by 2050. Commitments included working with asset owner clients on decarbonization goals, setting and reviewing interim targets for a proportion of assets to be managed in line with net zero by 2050, tracking portfolio emissions, prioritizing the achievement of emissions reductions in the sectors and companies in which they invest, and implementing a stewardship and engagement strategy – including a voting policy – consistent with a net zero by 2050 portfolio goal, among others.\nIn its update statement, NZAM announced that while it reviews the initiative, it will suspend the tracking of signatory implementation and reporting, and that it will remove its commitment statement from its website, along with the list of signatories, as well as their targets and related case studies.\nNZAM said:\n“As a voluntary initiative, NZAM has successfully supported investors globally as they have sought to navigate their own individual paths in the energy transition in line with their fiduciary duties and clients’ long-term financial objectives. NZAM looks forward to continuing to play this constructive role with investors around the world.”",
        "mention_count":2,
        "relevant_paragraphs":[
            "The move follows an announcement by BlackRock, the largest global investment management company, and an early NZAM signatory, that it had decided to leave the group, in a letter to clients that said that its membership in the coalition “caused confusion regarding BlackRock’s practices and subjected us to legal inquiries from various public officials.”"
        ],
        "esg_theme_counts":{
            "environmental":14,
            "social":0,
            "governance":5
        },
        "esg_keywords":{
            "environmental":[
                "climate",
                "net zero",
                "ghg",
                "environment",
                "greenhouse gas",
                "emissions"
            ],
            "social":[

            ],
            "governance":[
                "regulatory",
                "voting",
                "fiduciary"
            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":1.0,
        "sentiment":"positive",
        "positive_words":1,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"BlackRock Exits Net Zero Coalition, Says Move Won’t Change How it Manages Investments",
        "date":"January 10, 2025",
        "link":"https:\/\/www.esgtoday.com\/blackrock-exits-net-zero-coalition-says-move-wont-change-how-it-manages-investments\/",
        "excerpt":"BlackRock announced that it has decided to leave the Net Zero Asset Managers (NZAM) initiative, […]",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"blackrock",
        "categories":[

        ],
        "full_content":"BlackRock announced that it has decided to leave the Net Zero Asset Managers (NZAM) initiative, a major multi-trillion dollar group of investment managers committed to supporting the goal of net zero greenhouse gas emissions by 2050, marking a significant symbolic victory for anti-ESG politicians who had been threatening the investment giant over its participation in the coalition.\nDespite exiting the group, however, in a letter to clients signed by BlackRock Vice Chairman Philipp Hildebrand and Global Head of Sustainable and Transition Solutions Helen Lees-Jones, the firm said that the “departure doesn’t change the way we develop products and solutions for clients or how we manage their portfolios.”\nNZAM was launched in December 2020 with a group of 30 asset managers representing approximately $9 trillion of assets under management (AUM), and now includes more than 325 signatories and over $57 trillion in AUM. Signatories to NZAM agree to a series of commitments, including working with asset owner clients on decarbonization goals, setting and reviewing interim targets for a proportion of assets to be managed in line with net zero by 2050, tracking portfolio emissions, prioritizing the achievement of emissions reductions in the sectors and companies in which they invest, and implementing a stewardship and engagement strategy – including a voting policy – consistent with a net zero by 2050 portfolio goal, among others.\nBlackRock, as the largest global investment management company, and a leading voice in the investment community on climate and energy transition-related investment themes, has often found itself at the center of focus of the anti-ESG movement by Republican politicians in the U.S.\nMost recently, BlackRock, alongside its peers Vanguard and State Street was the target of a Texas-led multistate lawsuit, accusing the asset managers of using their positions in climate-focused investment initiatives to manipulate coal markets and drive up the cost of energy, which included participation in NZAM as evidence.\nIn its letter to clients, BlackRock reiterated that “participation in NZAM didn’t impact the way we managed client portfolios,” but noted that its membership in the group “caused confusion regarding BlackRock’s practices and subjected us to legal inquiries from various public officials.”\nThe letter also highlighted BlackRock’s climate investing credentials, noting that the firm manages more than $1 trillion in sustainable and transition investment strategies. Climate-focused investing has been a key focus for BlackRock over the past few years, with the firm stating as recently as in its January 2025 Benchmark Policies for investment stewardship that it in its view “the transition to a low-carbon economy is one of several mega forces reshaping markets.” Notably, the stewardship policy document also reiterated that BlackRock “cannot – and does not try to – direct a company’s strategy or its implementation. Setting, implementing and overseeing strategy are the responsibility of management and the board.”\nBlackRock’s announcement marks the latest in a rapid series of high-profile departures by U.S.-based financial services firms from net zero groups ahead of the inauguration of Donald Trump later this month, with all major banks – including JPMorgan, Citi, BofA, Morgan Stanley,  Goldman Sachs and Wells Fargo – exiting the Net-Zero Banking Association (NZBA) over the past few weeks. Despite leaving the group, however, each of the banks have maintained their individual financed emissions reduction commitments.",
        "mention_count":10,
        "relevant_paragraphs":[
            "BlackRock announced that it has decided to leave the Net Zero Asset Managers (NZAM) initiative, a major multi-trillion dollar group of investment managers committed to supporting the goal of net zero greenhouse gas emissions by 2050, marking a significant symbolic victory for anti-ESG politicians who had been threatening the investment giant over its participation in the coalition.",
            "Despite exiting the group, however, in a letter to clients signed by BlackRock Vice Chairman Philipp Hildebrand and Global Head of Sustainable and Transition Solutions Helen Lees-Jones, the firm said that the “departure doesn’t change the way we develop products and solutions for clients or how we manage their portfolios.”",
            "BlackRock, as the largest global investment management company, and a leading voice in the investment community on climate and energy transition-related investment themes, has often found itself at the center of focus of the anti-ESG movement by Republican politicians in the U.S.",
            "Most recently, BlackRock, alongside its peers Vanguard and State Street was the target of a Texas-led multistate lawsuit, accusing the asset managers of using their positions in climate-focused investment initiatives to manipulate coal markets and drive up the cost of energy, which included participation in NZAM as evidence.",
            "In its letter to clients, BlackRock reiterated that “participation in NZAM didn’t impact the way we managed client portfolios,” but noted that its membership in the group “caused confusion regarding BlackRock’s practices and subjected us to legal inquiries from various public officials.”",
            "The letter also highlighted BlackRock’s climate investing credentials, noting that the firm manages more than $1 trillion in sustainable and transition investment strategies. Climate-focused investing has been a key focus for BlackRock over the past few years, with the firm stating as recently as in its January 2025 Benchmark Policies for investment stewardship that it in its view “the transition to a low-carbon economy is one of several mega forces reshaping markets.” Notably, the stewardship policy document also reiterated that BlackRock “cannot – and does not try to – direct a company’s strategy or its implementation. Setting, implementing and overseeing strategy are the responsibility of management and the board.”",
            "BlackRock’s announcement marks the latest in a rapid series of high-profile departures by U.S.-based financial services firms from net zero groups ahead of the inauguration of Donald Trump later this month, with all major banks – including JPMorgan, Citi, BofA, Morgan Stanley,  Goldman Sachs and Wells Fargo – exiting the Net-Zero Banking Association (NZBA) over the past few weeks. Despite leaving the group, however, each of the banks have maintained their individual financed emissions reduction commitments."
        ],
        "esg_theme_counts":{
            "environmental":17,
            "social":1,
            "governance":2
        },
        "esg_keywords":{
            "environmental":[
                "carbon",
                "climate",
                "net zero",
                "greenhouse gas",
                "emissions",
                "sustainable"
            ],
            "social":[
                "community"
            ],
            "governance":[
                "voting",
                "board"
            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":1.0,
        "sentiment":"positive",
        "positive_words":2,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"Indiana to Replace BlackRock in Pension Funds Due to ESG Investing Policies",
        "date":"December 17, 2024",
        "link":"https:\/\/www.esgtoday.com\/indiana-to-replace-blackrock-in-pension-funds-due-to-esg-investing-policies\/",
        "excerpt":"The Indiana Public Retirement System (INPRS) voted to replace BlackRock as a manager in its […]",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"blackrock",
        "categories":[

        ],
        "full_content":"The Indiana Public Retirement System (INPRS) voted to replace BlackRock as a manager in its portfolio, due to the investment giant’s alleged use of ESG investment policies and its engagement using “an ESG focused agenda.”\nIn a press release from Indiana State Treasurer Daniel Elliott, who also serves as a member of the INPRS Board of Trustees, Elliott said lauded the board’s decision to remove BlackRock, describing the firm as an “ESG violator.”\nElliott said:\n“Today, I and other INPRS board members voted to put Hoosier public servants first by rejecting BlackRock and woke corporate policies. As Treasurer of State, I led the charge against ESG and other non-fiduciary policies that harm workers force that put Hoosier public employee pensions at risk.”\nThe announcement is the latest in a growing series of in an ongoing anti-ESG movement by Republican politicians in the U.S., with BlackRock, as the largest global investment management company, and a leading voice in the investment community on climate and energy transition-related investment themes, often in the spotlight. Most recently, BlackRock, alongside its peers Vanguard and State Street was the target of a multistate lawsuit, with Indiana as a participant, accusing the asset managers of using their positions in climate-focused investment initiatives to manipulate coal markets and drive up the cost of energy.\nBlackRock runs a passively managed international government bond index mandate for INPRS, with assets reportedly of nearly $1 billion.\nThe vote follows a report by Elliott in June 2024, which found that BlackRock “has engaged in an ESG commitment,” citing the asset managers participation in the Net Zero Asset Management initiative (NZAM), and finding that its “ESG commitment with respect to INPRS assets” is made “for a nonfinancial purpose in furtherance of social and ideological interests.” BlackRock’s response, included in the report, noted that its mandate to run a benchmark index mandate for INPRS, “does not have an ESG component or screen.” Indiana passed a bill in 2023, prohibiting the use of ESG factors in investment decisions for the public retirement system.\nIn its vote, the INPRS board affirmed that other comparable asset managers exist as an alternative to BlackRock to manage the Global Inflation-Linked Bonds portfolio, and mandated INPRS to select a new asset manager for the portfolio.\nNotably, BlackRock has scaled back its participation in sustainability-focused investment sector initiatives, including recently shifting its participation in engagement-focused coalition Climate Action 100+ to its international unit, citing a new strategy by CA100+ that would require signatories to commit to use client assets to pursue emissions reductions in portfolio companies. In a letter to CA100+ published on the asset manager’s website, BlackRock said that “the money BlackRock manages is not our own—it belongs to our clients—and BlackRock is committed to providing clients around the world with choices to support their unique and varied investment objectives.” BlackRock’s website also carries a ‘2030 net zero statement,’ which states that “our role is to help them navigate investment risks and opportunities, not to engineer a specific decarbonization outcome in the real economy.”\nIn a statement released following the vote, State Comptroller Elise Nieshalla, also a member of the INPRS board, said:\n“I do commend BlackRock’s recent action to discontinue its affiliation with Climate Action 100+, but more needs to be done including ending its support of Net Zero and similar initiatives to demonstrate a refocused commitment of prioritizing beneficiaries over a political agenda.”",
        "mention_count":15,
        "relevant_paragraphs":[
            "The Indiana Public Retirement System (INPRS) voted to replace BlackRock as a manager in its portfolio, due to the investment giant’s alleged use of ESG investment policies and its engagement using “an ESG focused agenda.”",
            "In a press release from Indiana State Treasurer Daniel Elliott, who also serves as a member of the INPRS Board of Trustees, Elliott said lauded the board’s decision to remove BlackRock, describing the firm as an “ESG violator.”",
            "“Today, I and other INPRS board members voted to put Hoosier public servants first by rejecting BlackRock and woke corporate policies. As Treasurer of State, I led the charge against ESG and other non-fiduciary policies that harm workers force that put Hoosier public employee pensions at risk.”",
            "The announcement is the latest in a growing series of in an ongoing anti-ESG movement by Republican politicians in the U.S., with BlackRock, as the largest global investment management company, and a leading voice in the investment community on climate and energy transition-related investment themes, often in the spotlight. Most recently, BlackRock, alongside its peers Vanguard and State Street was the target of a multistate lawsuit, with Indiana as a participant, accusing the asset managers of using their positions in climate-focused investment initiatives to manipulate coal markets and drive up the cost of energy.",
            "BlackRock runs a passively managed international government bond index mandate for INPRS, with assets reportedly of nearly $1 billion.",
            "The vote follows a report by Elliott in June 2024, which found that BlackRock “has engaged in an ESG commitment,” citing the asset managers participation in the Net Zero Asset Management initiative (NZAM), and finding that its “ESG commitment with respect to INPRS assets” is made “for a nonfinancial purpose in furtherance of social and ideological interests.” BlackRock’s response, included in the report, noted that its mandate to run a benchmark index mandate for INPRS, “does not have an ESG component or screen.” Indiana passed a bill in 2023, prohibiting the use of ESG factors in investment decisions for the public retirement system.",
            "In its vote, the INPRS board affirmed that other comparable asset managers exist as an alternative to BlackRock to manage the Global Inflation-Linked Bonds portfolio, and mandated INPRS to select a new asset manager for the portfolio.",
            "Notably, BlackRock has scaled back its participation in sustainability-focused investment sector initiatives, including recently shifting its participation in engagement-focused coalition Climate Action 100+ to its international unit, citing a new strategy by CA100+ that would require signatories to commit to use client assets to pursue emissions reductions in portfolio companies. In a letter to CA100+ published on the asset manager’s website, BlackRock said that “the money BlackRock manages is not our own—it belongs to our clients—and BlackRock is committed to providing clients around the world with choices to support their unique and varied investment objectives.” BlackRock’s website also carries a ‘2030 net zero statement,’ which states that “our role is to help them navigate investment risks and opportunities, not to engineer a specific decarbonization outcome in the real economy.”",
            "“I do commend BlackRock’s recent action to discontinue its affiliation with Climate Action 100+, but more needs to be done including ending its support of Net Zero and similar initiatives to demonstrate a refocused commitment of prioritizing beneficiaries over a political agenda.”"
        ],
        "esg_theme_counts":{
            "environmental":8,
            "social":2,
            "governance":6
        },
        "esg_keywords":{
            "environmental":[
                "emissions",
                "net zero",
                "climate"
            ],
            "social":[
                "community",
                "employee"
            ],
            "governance":[
                "fiduciary",
                "board"
            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":1.0,
        "sentiment":"positive",
        "positive_words":2,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"BlackRock, Temasek Decarbonization Fund Invests in Residential Energy Transition Solutions Provider ConnectDER",
        "date":"December 4, 2024",
        "link":"https:\/\/www.esgtoday.com\/blackrock-temasek-decarbonization-fund-invests-in-residential-energy-transition-solutions-provider-connectder\/",
        "excerpt":"Philadelphia-based ConnectDER announced that it has raised $35 million in a Series D funding round […]",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"blackrock",
        "categories":[

        ],
        "full_content":"Philadelphia-based ConnectDER announced that it has raised $35 million in a Series D funding round to expand the market and innovation for its at-home electric vehicle charging and solar panel connection technology. The round was led by by BlackRock and Temasek’s decarbonization-focused fund, Decarbonization Partners.\nFounded in 2011, ConnectDER provides technology enabling households to install solar panels and chargers for EVs without requiring an upgrade in the home electricity system, while remaining connected to the grid for power when stored solar-generated power is depleted.\nAlong with the funding round announcement, ConnectDER unveiled the next generation of its Meter Socket Adapter (MSA), the “IslandDER,” which the company said is designed to seamlessly integrate with the utility grid, and enable islanding of solar, battery storage, EVs, and other distributed energy resources.\nIvo Steklac, CEO of ConnectDER, said:\n“With this latest Series D funding we’re poised to not only expand our existing markets but also our offerings by bringing a transformative solution for energy storage systems to the market. Our forthcoming IslandDER enables homes to disconnect and reconnect from the grid enabling customers to harness stored energy from solar plus battery systems or EVs providing innovative backup power and resilience to market at an incredibly competitive cost point.”\nIn the U.S., 60 million homes lack the capacity for solar, EV-charging, or resilient energy solutions without costly equipment upgrades. According to the company, its system enables households to utilize solar energy at a far lower cost than would otherwise be required to upgrade a home’s service panel and\/or pay utility interconnect fees. ConnectDER said it plans to use the funds raised for market expansion, scaling manufacturing, and continued product innovation. Currently there are over 25,000 ConnectDER adapters in use across 22 states. The company said it expects to be selling them across the United States in the next few years.\nDecarbonization Partners, which led the funding round, was launched by BlackRock and Temasek in 2022, establishing a late-stage venture capital and growth private equity partnership to invest in companies providing technologies and solutions that help accelerate the transition to a net zero economy by 2050. Also participating in the round were new investors MassMutual Ventures, as well as existing investors Avista Development, Clean Energy Ventures, Energy Innovation Capital, Evergy Ventures, LG Technology Ventures, and Zoma Capital.\nDr. Meghan Sharp, Global Head and Chief Investment Officer of Decarbonization Partners, said:\n“We are excited to partner with ConnectDER, which has built an elegant solution that solves a major adoption pain point for customers, enabling and accelerating affordable home electrification in North America. We look forward to supporting the ConnectDER team as they continue executing on their growth journey.”",
        "mention_count":2,
        "relevant_paragraphs":[
            "Philadelphia-based ConnectDER announced that it has raised $35 million in a Series D funding round to expand the market and innovation for its at-home electric vehicle charging and solar panel connection technology. The round was led by by BlackRock and Temasek’s decarbonization-focused fund, Decarbonization Partners.",
            "Decarbonization Partners, which led the funding round, was launched by BlackRock and Temasek in 2022, establishing a late-stage venture capital and growth private equity partnership to invest in companies providing technologies and solutions that help accelerate the transition to a net zero economy by 2050. Also participating in the round were new investors MassMutual Ventures, as well as existing investors Avista Development, Clean Energy Ventures, Energy Innovation Capital, Evergy Ventures, LG Technology Ventures, and Zoma Capital."
        ],
        "esg_theme_counts":{
            "environmental":1,
            "social":1,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "net zero"
            ],
            "social":[
                "equity"
            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":1.0,
        "sentiment":"positive",
        "positive_words":5,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"ESG Today: Week in Review",
        "date":"March 23, 2025",
        "link":"https:\/\/www.esgtoday.com\/esg-today-week-in-review-207\/",
        "excerpt":"Excerpt not available",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"blackrock",
        "categories":[

        ],
        "full_content":"This week in ESG news: SBTi publishes first draft of new corporate net zero standard; Canada’s new PM cancels consumer carbon tax; Amazon launches service to sell carbon credits to companies; UBS pushes back net zero goals after acquiring Credit Suisse; BlackRock enhances sustainability characteristics for funds ahead of new regulations; global accounting body adds sustainability reporting skills into training standards; new resource launched for companies reporting on sustainability under both CDP and CSRD; EU launches strategy to decarbonize steel and metals industry; CIP raises more than $13 billion for energy transition fund; Nordea wins €800 million decarbonization-focused investment mandate; capital raises for batter tech, clean fuels, AI-powered solar solutions, and more.\nSee below for the highlights of the past week, and get all your ESG news at ESG Today:\nAmazon Launches Carbon Credit Investment Service\nSBTi Releases Initial Draft of New Corporate Net Zero Standard\nNordea Signs 68,000 Tonne Carbon Removal Agreement\nUBS Pushes Back Net Zero Target by 10 Years Following Credit Suisse Acquisition\nCDP, EFRAG Release Mapping Connecting CDP Disclosures with CSRD Climate Reporting Standards\nIFAC Adds Sustainability Reporting Skills into Training Standards for New Accountants\nGuest Post – Transforming Reporting into Strategy: Navigating Europe’s Omnibus Package\nEU Launches Series of Actions and Investments to Decarbonize Steel, Metal Sectors\nAustralia Court Fines Active Super A$10.5 Million for Greenwashing ESG Investing Claims\nCarney Eliminates Canada’s Consumer Carbon Tax\nNasdaq-backed Carbon Credit Platform Puro.earth Passes 1 Million Tonne Carbon Removal Milestone\nApave Acquires Carbon Accounting Platform Aktio\nLRQA Acquires Energy Transition Consulting Firm EcoEngineers\nUpright Launches 50,000 Company Double Materiality Assessment Database\nArcmont Secures €475 Million Investment Mandates from APG, TIAA for New Impact Lending Strategy\nNeste Issues €700 Million Green Bond to Scale Renewable Fuels Production\nCleantech Startup C1 Raises $22 Million to Replace Fossil Fuels in Shipping, Aviation and Chemicals\nPulsetrain Raises €6.1 Million for Solution to Extend EV Battery Life up to 80%\nCoreshell Raises $24 Million to Scale Low-Cost Silicon EV Batteries\nTerabase Raises $130 Million for Robotics Technology to Scale Deployment of Solar Power Plants\nCIP Raises Over $13 Billion for Energy Transition Infrastructure Fund\nNordea Awarded €800 Million Decarbonization-Focused Equity Mandate by Ircantec\nBlackRock Enhances Sustainability Characteristics of $92 Billion of Funds Ahead of ESMA ESG Fund Naming Rules\nMicrosoft, CalSTRS Back $175 Million Natural Climate Solutions Strategy by Just Climate",
        "mention_count":2,
        "relevant_paragraphs":[
            "This week in ESG news: SBTi publishes first draft of new corporate net zero standard; Canada’s new PM cancels consumer carbon tax; Amazon launches service to sell carbon credits to companies; UBS pushes back net zero goals after acquiring Credit Suisse; BlackRock enhances sustainability characteristics for funds ahead of new regulations; global accounting body adds sustainability reporting skills into training standards; new resource launched for companies reporting on sustainability under both CDP and CSRD; EU launches strategy to decarbonize steel and metals industry; CIP raises more than $13 billion for energy transition fund; Nordea wins €800 million decarbonization-focused investment mandate; capital raises for batter tech, clean fuels, AI-powered solar solutions, and more.",
            "BlackRock Enhances Sustainability Characteristics of $92 Billion of Funds Ahead of ESMA ESG Fund Naming Rules"
        ],
        "esg_theme_counts":{
            "environmental":17,
            "social":1,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "carbon",
                "climate",
                "green",
                "net zero",
                "renewable"
            ],
            "social":[
                "equity"
            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":2,
        "sustainable_finance_keywords":[
            "green bond",
            "esg fund"
        ],
        "sustainable_finance_focus":false,
        "sentiment_score":-1.0,
        "sentiment":"negative",
        "positive_words":0,
        "negative_words":1,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"Cleantech Startup C1 Raises $22 Million to Replace Fossil Fuels in Shipping, Aviation and Chemicals",
        "date":"March 21, 2025",
        "link":"https:\/\/www.esgtoday.com\/cleantech-startup-c1-raises-22-million-to-replace-fossil-fuels-in-shipping-aviation-and-chemical-sectors\/",
        "excerpt":"Excerpt not available",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"blackrock",
        "categories":[

        ],
        "full_content":"Berlin-based cleantech startup C1 Green Chemicals announced that it has raised €20 million (USD$21.7 million), with proceeds from the financing aimed at commercializing its green methanol technology and help move emissions-intensive sectors away from fossil feedstocks.\nFounded in 2022, C1 develops new, climate-friendly chemical processes, exclusively on the basis of renewable raw materials and energy, designed with the help of quantum chemical simulations, and implemented in proprietary production technologies. The company has developed a new proprietary process for the production of high-purity green methanol, using decentralized, non-fossil feedstock, low pressures, and low temperatures, enabling mass production at a competitive cost, and providing a solution to replace fossil resources in the shipping, aviation and chemical industries.\nThe company said that it will use the new capital to build a demonstration plant for its methanol production solution, with construction scheduled to begin this year.\nChristian Vollmann, CEO of C1 Green Chemicals AG, said:\n“Two ingredients are crucial for the successful commercialization of scientific innovation: talent and capital. We are delighted that we at C1 have excellent access to both ingredients.”\nOf the total capital raised, €15 million came from investors led by denkapparat, the family office of the founders of German software firm Think-Cell, Markus Hannebauer and Arno Schödl. Planet A Ventures, Maersk Growth, SquareOne, former Linde CEO Wolfgang Reitzle and Siemens Chairman Jim Hagemann Snabe also took part in the funding round, and another €5 million came from approved research grants.\nHannebauer said:\n“At C1, everything comes together perfectly: Cutting-edge research targeting an ecologically and commercially significant problem, pragmatic founders with a clear vision, and a team boasting impressive technological and commercial expertise. This is exactly the profile we are looking for as entrepreneurial investors. It was immediately clear that we would take the lead in this round.”",
        "mention_count":0,
        "relevant_paragraphs":[

        ],
        "esg_theme_counts":{
            "environmental":7,
            "social":0,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "renewable",
                "emissions",
                "green",
                "climate"
            ],
            "social":[

            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":0.0,
        "sentiment":"neutral",
        "positive_words":0,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"Nasdaq-backed Carbon Credit Platform Puro.earth Passes 1 Million Tonne Carbon Removal Milestone",
        "date":"March 21, 2025",
        "link":"https:\/\/www.esgtoday.com\/nasdaq-backed-carbon-credit-platform-puro-earth-passes-1-million-tonne-carbon-removal-milestone\/",
        "excerpt":"Excerpt not available",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"blackrock",
        "categories":[

        ],
        "full_content":"Carbon-crediting platform Puro.earth announced that it has achieved the issuance of more than 1 million CO2 removal certificates – representing more than 1 million tonnes of verified carbon removal – following a significant acceleration in the market over the past several months.\nFounded in 2018, and acquired by Nasdaq in 2021, Puro.earth provides a platform bringing together suppliers of carbon net-negative technologies and companies looking to reduce or counter their carbon footprints. Through Puro.earth’s platform, and based on its carbon credit methodologies, suppliers that remove CO2 from the atmosphere to durable storage of at least 100 years are certified and issued CO2 Removal Certificates (CORCs) into the Puro Registry, which can then be purchased by companies.\nPuro.earth said that it took nearly five years from its first CORCs issuances in 2019 to reach 500,000 issued CORCs in Q1 2024, with growth growing exponentially to reach 1 million CORCs only one year later.\nThe company added that it is on track for issuance of the next million CORCs before the end of H1 2026.\nPuro.earth President Jan-Willem Bode said:\n“Reaching one million of CO₂ removals is just the beginning—our goal is to continue to use our expertise and track record to deliver proven, scalable and high-quality carbon removal credits. The next million is already within reach, and we will continue to ensure that businesses worldwide have access to trusted, verifiable carbon removal credits, at scale.”\nBy methodology, Puro.earth said that Geologically Stored Carbon (GSC)– such as Direct Air Capture Carbon and Storage (DACCS) and Bio Energy Carbon Capture and Storage (BECCS) – and Biochar, have been particularly popular with buyers, each representing more than 34% of issuances, as they offer scalable, high-impact solutions for carbon removal with well-defined processes and measurable outcomes. By location, the U.S. leads issuances by a wide margin, at 45%, followed by Finland at 9.9%, Bolivia at 9.6% and Brazil at 9.2%., with other strong markets including Austria, Norway, and the UK.\nPuro.earth attributed shifting buyer sentiment as a key factor in the sector’s growth, noting buyers such as Microsoft, Google, and the Frontier Buyers that have led in the development of the early-stage durable CDR market, allowing technologies and suppliers to scale. It added that the market is seeing increased interest from buyers in hard-to-abate sectors, such as aviation, concrete, steel manufacturing, shipping, and chemical production.\nAntti Vihavainen, Vice Chairman of Puro.earth, said:\n“We want to thank the key players that have come together to build the CDR market with us: the courageous investors who ventured into the unknown, the pioneering entrepreneurs who chose innovation over business-as-usual, and the forward-thinking buyers whose commitments make everything move.”",
        "mention_count":0,
        "relevant_paragraphs":[

        ],
        "esg_theme_counts":{
            "environmental":11,
            "social":0,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "carbon"
            ],
            "social":[

            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":1.0,
        "sentiment":"positive",
        "positive_words":2,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"Apave Acquires Carbon Accounting Platform Aktio",
        "date":"March 20, 2025",
        "link":"https:\/\/www.esgtoday.com\/apave-acquires-carbon-accounting-platform-aktio\/",
        "excerpt":"Excerpt not available",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"blackrock",
        "categories":[

        ],
        "full_content":"Risk management services provider Apave Group announced the acquisition of French carbon accounting firm Aktio, in a move aimed at helping Apave to strengthen its expertise in sustainability and decarbonization.\nFounded in 2020, Paris-based Aktio provides climate consulting services and greenhouse gas accounting and management software solutions aimed at supporting companies in their low-carbon transition. The company’s platform supports companies in measuring their carbon footprint, setting climate targets and defining a low-carbon trajectory, implementing decarbonization plans, complying with regulations such as CSRD, and communicating and training on the low-carbon transition approach.\nSince launching, Aktio has grown to approximately 40 experts, climate consultants and web developers, and has supported 500 organizations in addressing their decarbonization challenges.\nAktio co-founders Laurent Barbezieux, Alex Huyn and Thibault Faninger said:\n“At a time when the risks and consequences of climate change are intensifying, it is more essential than ever to democratize the low-carbon transition as quickly as possible. Joining the Apave Group, a leading player in environmental consulting and auditing, is an exceptional acceleration opportunity for Aktio, to equip, train and support the carbon accountants of tomorrow.”\nAccording to Apave, the acquisition will help strengthen its ‘Green & Social’ range of services, which aimsto support the success of their clients’ transition plans across areas including energy transition, climate transition, and social and societal transition. Apave’s benchmark entity in terms of sustainability will be the newly formed Aktio-Apave, formed by combining Aktio’s experts and consultants and the experts and consultants from Apave’s ‘Climate and Sustainability’ department.\nPhilippe Maillard, CEO of the Apave Group, said:\n“Today, we are taking a new step with the acquisition of Aktio, fully in line with our corporate purpose: ‘To act as a trusted partner to make the world safer, more sustainable and a source of shared progress.’ We are thus accelerating our desire to be able to support our clients even more and better in their sustainable performance objectives, whether these relate to technical, human, environmental, digital or climate issues.”",
        "mention_count":0,
        "relevant_paragraphs":[

        ],
        "esg_theme_counts":{
            "environmental":19,
            "social":0,
            "governance":1
        },
        "esg_keywords":{
            "environmental":[
                "carbon",
                "climate",
                "carbon footprint",
                "green",
                "greenhouse gas",
                "sustainable"
            ],
            "social":[

            ],
            "governance":[
                "risk management"
            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":1.0,
        "sentiment":"positive",
        "positive_words":3,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"Nordea Awarded €800 Million Decarbonization-Focused Equity Mandate by Ircantec",
        "date":"March 20, 2025",
        "link":"https:\/\/www.esgtoday.com\/nordea-awarded-e800-million-decarbonization-focused-equity-mandate-by-ircantec\/",
        "excerpt":"Excerpt not available",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"blackrock",
        "categories":[

        ],
        "full_content":"Northern Europe-based asset manager Nordea Asset Management announced that it has been selected to help manage a €800 million (USD$867 million) decarbonization-focused global equity investment mandate for French pension plan Iracantec, in partnership with Paris-based asset management firm ODDO BHF AM.\nIrcantec is a French complementary pension scheme with more than €17 billion (USD $18.4 billion) invested in the financial markets. The organization announced a series of commitments in 2021 aimed at ensuring that its reserves are on course to ensure emissions reductions compatible with a 1.5°C scenario. Ircantec’s sustainable investment initiatives include a strategy to phase out fossil fuels by 2030, and a target of reducing emissions from its portfolio of companies by 7% per year on average until 2050.\nThe new mandate will utilize a customized active global equity solution based on Nordea’s BetaPlus Responsible Enhanced Equities Strategies, and will use Nordea’s proprietary decarbonization tools to track companies’ progress towards net zero, helping Ircantec achieve its 7% annual CO2 reduction goal. The mandate will be managed by Nordea’s Multi Assets Team.\nChristophe Girondel, Global Head of Institutional and Wholesale Distribution at Nordea Asset Management, said:\n“We are grateful for Ircantec’s trust in our longstanding BetaPlus capabilities, and we look forward to helping them progress toward a low-carbon future. The opportunity to support Ircantec in reaching their decarbonization target underscores our commitment to aligning climate objectives with investment performance.”",
        "mention_count":0,
        "relevant_paragraphs":[

        ],
        "esg_theme_counts":{
            "environmental":6,
            "social":2,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "carbon",
                "climate",
                "net zero",
                "emissions",
                "sustainable"
            ],
            "social":[
                "equity"
            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":1.0,
        "sentiment":"positive",
        "positive_words":8,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"Nordea Signs 68,000 Tonne Carbon Removal Agreement",
        "date":"March 18, 2025",
        "link":"https:\/\/www.esgtoday.com\/nordea-signs-68000-tonne-carbon-removal-agreement\/",
        "excerpt":"Excerpt not available",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"blackrock",
        "categories":[

        ],
        "full_content":"Northern Europe-based financial services company Nordea announced that it has signed a deal with Norwegian startup Inherit Carbon Solutions to remove at least 68,000 tonnes of carbon dioxide from the atmosphere, providing carbon removal credits to the bank starting next year.\nThis multi-year contract is the first of what the bank says will be a portfolio of agreements with companies working on carbon removal projects. Under the agreement, Inherit will implement its system to capture CO2 from a biogas plant in Denmark. Once captured, the CO2 will be liquified and transported for geological storage under the North Sea.\nNordea announced a commitment in 2021 to become a net zero bank by 2050, along with a series of interim 2030 targets including reductions in carbon emissions from lending and investment portfolios by 40-50%, reductions in internal carbon emissions by at least 50% and the achievement of net positive carbon contribution.\nThe firm said that by the end of 2024, it had reduced emissions from its own operations by 53% compared with 2019, and with its goal to achieve net positive carbon contribution by 2030, it aims for the amount of high-quality carbon removal credits to exceed the unabated emissions from its own operations.\nPeter Sandahl, Head of Climate & Environment at Nordea said:\n“This agreement is a milestone in Nordea’s new carbon removal strategy and reflects our ambition to support the scaling of high-quality carbon removal technologies. . .Through this commitment we are accelerating our operational sustainability efforts and, in addition, supporting the scaling of innovative solutions essential to reach long-term climate goals and keeping global warming within the boundaries of the Paris Agreement.”\nFounded in 2021, Oslo, Norway-based Inherit captures and permanently stores CO2 released from production of renewable natural gas (RNG), which is produced from organic waste, such as agricultural, industrial, and household wastes. Unlike other carbon removal solutions, CO2 captured from RNG production doesn’t have to be separated from other materials as It is created during the production of RNG, which does not contribute to climate change and is used as a fuel in the Nordics and elsewhere. After capturing carbon from biogas plants, Inherit liquifies the CO2 and transports it for permanent geological storage.\nKaja Voss, Co-CEO of Inherit, said:\n“We are excited to partner with Nordea on this groundbreaking project and to see that Nordea goes to such great lengths to accelerate the carbon removal industry. Together, we’re taking an important step towards a net zero future, and we look forward to this collaboration going forward.”",
        "mention_count":0,
        "relevant_paragraphs":[

        ],
        "esg_theme_counts":{
            "environmental":26,
            "social":0,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "carbon",
                "climate",
                "net zero",
                "renewable",
                "environment",
                "waste",
                "emissions"
            ],
            "social":[

            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":1.0,
        "sentiment":"positive",
        "positive_words":5,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"UBS Pushes Back Net Zero Target by 10 Years Following Credit Suisse Acquisition",
        "date":"March 18, 2025",
        "link":"https:\/\/www.esgtoday.com\/ubs-pushes-back-net-zero-target-by-10-years-following-credit-suisse-acquisition\/",
        "excerpt":"Excerpt not available",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"blackrock",
        "categories":[

        ],
        "full_content":"UBS revealed in its 2024 Sustainability Report that it has pushed back its target to achieve net zero greenhouse gas (GHG) emissions in its operations by 10 years to 2035, from its prior 2025 goal, attributing the change largely due to the effect of the bank’s acquisition of Credit Suisse.\nThe bank also withdrew a target for its Asset Management division to align 20% of its assets under management (AUM) with net zero by 2030, saying that it is reviewing the goal due to the integration of Credit Suisse.\nThe announcement by UBS marks the latest in a series of moves by banks globally to withdraw or pull back on climate commitments, although UBS’ changes appear less drastic than those by some of its peers. HSBC, for example, recently pushed back its own target to achieve net zero emissions in its operations and supply chain by 20 years to 2050, and placed its interim financed emissions targets under review, all major U.S., Canadian and some other banks have left the Net-Zero Banking Alliance, and Wells Fargo entirely dropped its target to achieve net zero financed emissions by 2050, and its sector-specific 2030 interim financed emissions targets.\nUBS remains a member of the NZBA, and in its report, the bank confirmed that it remains committed to its financed emissions decarbonization targets. UBS has 2030 financed emissions goals in place for the Swiss residential and commercial real estate, power generation, iron and steel, cement, and fossil fuel sectors.\nThe report, however, changed language on UBS’ key climate commitments from its 2023 report, in which the bank said that “by 2050, our ambition is to achieve net-zero greenhouse gas emissions across our scope 1 and 2, and specified scope 3 activities,” updating it with “by 2050, the global economy aims to transition to net zero. For example, across our own operations (scopes 1 and 2), UBS plans to achieve net zero by 2035, well ahead of 2050,” and outlining its Scope 3 goal as “addressing our financed emissions by aligning specified sectors to decarbonization pathways.”\nUBS attributed the change in its operational net zero goal to its “enlarged corporate real estate portfolio following the acquisition of the Credit Suisse Group,” as well as to “the latest definition of a “net-zero target” in the Corporate Sustainability Reporting Directive (CSRD).”\nAlongside the updated net zero target, UBS also set out a new interim goal to reduce Scope 1 and 2 emissions by 57% by 2030, on a 2023 baseline, as well as a commitment to source 100% of electricity from renewable-source-qualifying generation by 2026. For the 2035 net zero target, UBS said that it aims to reduce emissions by at least 90% before neutralizing any residual emissions through the purchase of carbon removal credits, while the interim 2030 goal does not include the use of any carbon removal credits.\nIn its Asset Management business, UBS said that it withdrew its 2030 target as it is “reviewing the legacy target set prior to the acquisition of the Credit Suisse Group, taking into account all of the AuM of the combined businesses.” In the report, UBS said that its assets under management with a net zero ambition reached $64.4 billion, or 3.6% of AUM (including Credit Suisse AUM), up from $35.5 billion and 2.9% of AUM in 2023 (excluding Credit Suisse AUM).",
        "mention_count":0,
        "relevant_paragraphs":[

        ],
        "esg_theme_counts":{
            "environmental":30,
            "social":0,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "carbon",
                "climate",
                "net zero",
                "ghg",
                "renewable",
                "greenhouse gas",
                "emissions"
            ],
            "social":[

            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":1.0,
        "sentiment":"positive",
        "positive_words":6,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"Neste Issues €700 Million Green Bond to Scale Renewable Fuels Production",
        "date":"March 17, 2025",
        "link":"https:\/\/www.esgtoday.com\/neste-issues-e700-million-green-bond-to-scale-renewable-fuels-production\/",
        "excerpt":"Excerpt not available",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"blackrock",
        "categories":[

        ],
        "full_content":"Sustainable fuel producer Neste announced that it has raised €700 million (USD$765 million) in a green bond offering, with proceeds aimed at supporting the expansion of its Rotterdam refinery, set to become the largest renewable diesel and sustainable aviation fuel (SAF) facility in the world, according to the company.\nFinland Neste provides renewable and circular solutions for sectors including road transport, aviation, and polymers and chemicals. The company’s products include Neste MY Sustainable Aviation Fuel, made from sustainably sourced renewable waste and residues such as used cooking oil and animal fat waste, and compatible with existing aircraft engines and airport fuel infrastructure, and Neste MY Renewable Diesel, produced from renewable raw materials using a hydrogen treatment process, that can be used as a drop-in replacement to fossil diesel, to significantly reduce GHG emissions.\nThe company’s Rotterdam refinery started producing renewable products in 2011, and has a current capacity of 1.4 million tons. Neste is undertaking a €1.9 billion expansion of the refinery, aimed at expanding its annual renewable product capacity to 2.7 million tons, which would include 1.2 million tons of sustainable aviation fuel, with a target to start up the new production unit in 2026. Neste recently signed a deal with DHL to provide the logistics giant with 300,000 tons of unblended SAF per year by 2030.\nAnssi Tammilehto, Interim CFO of Neste, said:\n“The recent development in the renewables market has been challenging, but we have a clear plan forward. We are pleased to see strong participation from high-quality investors in this new issue. The net proceeds from this Green Bond are expected to be steered towards our expansion of the Rotterdam refinery, which is expected to become the world’s largest renewable diesel and sustainable aviation fuel facility.”\nThe new 5-year green bond will pay a fixed coupon of 3.75%.",
        "mention_count":0,
        "relevant_paragraphs":[

        ],
        "esg_theme_counts":{
            "environmental":20,
            "social":0,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "green",
                "ghg",
                "renewable",
                "waste",
                "emissions",
                "sustainable"
            ],
            "social":[

            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":3,
        "sustainable_finance_keywords":[
            "green bond"
        ],
        "sustainable_finance_focus":false,
        "sentiment_score":1.0,
        "sentiment":"positive",
        "positive_words":4,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"BNP Paribas AM Establishes €800 Million Venture and Impact Platform",
        "date":"March 12, 2025",
        "link":"https:\/\/www.esgtoday.com\/bnp-paribas-am-launches-e800-million-venture-and-impact-platform\/",
        "excerpt":"Excerpt not available",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"blackrock",
        "categories":[

        ],
        "full_content":"BNP Paribas Asset Management (BNPP AM) announced the creation of a new entity, the Venture and Impact platform, within its Private Assets division.\nLaunched with €800 million (USD$879 million) in assets under management, and dedicated to innovation and venture capital, the new platform combines the activities of BNPP AM’s Ecological Transition and Impact, Fintech and the Solar Impulse Venture Fund.\nThe Venture and Impact platform is led by Yann Lagalaye. Lagalaye has been serving as Head of Ecological Transition & Impact, managing the BNPP Agility Capital team in charge of the Solar Impulse Venture Fund, as well as the BNP Paribas Principal Investment teams in charge of the Ecological Transition Capital venture capital investment line and the Impact investment line dedicated to impact fund, project or small cap with a focused on natural capital and local development.\nAs part of the reorganization, the firm also announced the appointment of Marinus Oosterbeek and Vincent Baillin as Managing Directors at Opera Tech Ventures (OTV), BNP Paribas Group’s venture capital fund dedicated to the transformation of the financial industry.\nLagalaye said:\n“I would like to congratulate Marinus and Vincent on their appointment as Managing Directors. This promotion demonstrates the trust of BNP Paribas Group in their expertise and their ability to accelerate the development of the fund, which plays a key role in the Group’s digital transformation strategy. By positioning OTV within Private Assets’ Venture & Impact platform, we are committed to the growth of a dedicated innovation and venture capital team.”",
        "mention_count":0,
        "relevant_paragraphs":[

        ],
        "esg_theme_counts":{
            "environmental":0,
            "social":0,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[

            ],
            "social":[

            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"undetermined",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":1.0,
        "sentiment":"positive",
        "positive_words":4,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"EU Launches Series of Actions and Investments to Decarbonize Steel, Metal Sectors",
        "date":"March 20, 2025",
        "link":"https:\/\/www.esgtoday.com\/eu-launches-series-of-actions-and-investments-to-decarbonize-steel-metal-sectors\/",
        "excerpt":"Excerpt not available",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"blackrock",
        "categories":[

        ],
        "full_content":"The European Commission announced the launch of its Action Plan on Steel and Metals, outlining a broad range of initiatives aimed at protecting and strengthening the industry’s competitiveness, and supporting its decarbonization.\nAccording to the Commission, the new Action Plan comes as the European steel and metals industry faces a series of challenges, including high energy costs, and unfair global competition, as well as a need for investments to reduce greenhouse gas emissions, with the sector being one of the EU’s largest industrial emitters. The plan focuses on six key pillars, including ensuring access to clean and affordable energy, preventing carbon leakage, strengthening European industrial capacities, promoting circularity for metals, defending quality industrial jobs, and de-risking projects through lead markets and public support.\nThe release marks the second Action Plan, after one focused on the automotive sector, to be launched by the Commission under its new “Competitiveness Compass” roadmap to boost Europe’s productivity and global competitiveness. The roadmap included plans to introduce in 2025 “tailor-made action plans” for key energy-intensive industries, as well as plans for initiatives including a proposed “Industrial Decarbonisation Accelerator Act” targeting streamlined permitting for renewable energy for emissions-intensive sectors, and a review of the Carbon Border Adjustment Mechanism (CBAM).\nWithin the pillars focused on sector decarbonization, the Commission unveiled a series of initiatives and plans aimed at boosting the industry’s access to and use of clean energy, promoting investment in clean technologies, and de-risking emissions reduction investments for companies.\nKey actions to increase the use of clean energy include promoting the use of Power Purchase Agreements (PPAs), encouraging member states to reduce network tariffs to alleviate electricity price volatility, promoting faster grid access and supporting the increased use of renewable and low-carbon hydrogen.\nSustainability-focused funding and incentives highlighted by the plan include plans to mobilize €100 billion in funding at scale-up stage through the “Industrial Decarbonisation Bank” announced in February in the Clean Industrial Deal, starting with a €1 billion pilot auction in 2025 focusing on decarbonizing and electrifying key industrial processes.\nThe Action Plan also aims to implement measures to address “carbon leakage” in the sector, a situation in which companies move production of emissions intensive goods to countries with less stringent environmental and climate policies, through revisions to the Carbon Border Adjustment Mechanism (CBAM), the EU’s carbon tax on imported goods. Plans include introducing a legislative proposal later this year to extend the scope of CBAM to certain steel and aluminium-based downstream products and to include additional anti-circumvention measures.\nAdditionally, the Action Plan includes a series of actions aimed at boosting circularity in the metals industry, including plans to set targets for recycled steel and aluminium in key sectors, assessing whether products such as construction materials and electronics should have recycling or recycled content requirements, and considering trade measures on metal scrap to ensure sufficient availability of scrap.\nEuropean Commission President Ursula von der Leyen said:\n“The steel industry has always been a core engine for European prosperity. Next-generation, clean steel should therefore continue to be manufactured in Europe. That means we have to help our steelmakers who are facing strong headwinds on the global market. To make sure they remain competitive, we must reduce energy costs and help them introduce innovative, low-carbon technologies to the market. With today’s Action Plan we are offering concrete solutions for a thriving European steel industry.”",
        "mention_count":0,
        "relevant_paragraphs":[

        ],
        "esg_theme_counts":{
            "environmental":16,
            "social":0,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "carbon",
                "climate",
                "renewable",
                "recycling",
                "greenhouse gas",
                "emissions"
            ],
            "social":[

            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":1.0,
        "sentiment":"positive",
        "positive_words":1,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"Carney Eliminates Canada’s Consumer Carbon Tax",
        "date":"March 17, 2025",
        "link":"https:\/\/www.esgtoday.com\/carney-eliminates-canadas-consumer-carbon-tax\/",
        "excerpt":"Excerpt not available",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"blackrock",
        "categories":[

        ],
        "full_content":"In his first act as Canada’s new Prime Minister, Mark Carney signed an order on Friday eliminating a controversial consumer carbon tax, the “fuel charge,” effective April 1, 2025.\nIntroduced in 2019, the fuel charge aimed to introduce a price on carbon for businesses and consumers in order to incentivize emissions reductions and to adopt cleaner technologies and products. The carbon tax started at $20 per tonne in 2019, and has been increasing annually, and was set to reach $170 per tonne in 2030.\nThe elimination of the fuel charge follows a campaign by Canada’s Conservative Leader Pierre Poilievre over the past several months against the carbon tax, as consumers faced high inflation. Despite championing the carbon tax in the past, Carney’s campaign for Liberal party leadership acknowledged that it “isn’t working and has become too divisive,” and pledged to cancel it.\nCarney takes the office of Prime Minister with a strong resume in both finance and climate action. He has served as the Governor of the both the Banks of Canada and of England, as the UN Special Envoy for Climate Action and Finance, as the UK Prime Minister’s Finance Adviser for the COP26 UN Climate Change Conference, and as co-Chair of the Glasgow Financial Alliance for Net Zero (GFANZ). Prior to running for Liberal leadership, he was serving as Chair and Head of Transition Investing at Brookfield Asset Management, focused on ESG investing.\nWhile the consumer carbon tax will be ending, the carbon price on businesses will remain in place. In his leadership campaign, Carney pledged to ensure that “Canada’s biggest emitters will contribute their fair share,” with a plan to tighten the Output-Based Pricing System (OBPS) for large, industrial emitters, and to introduce a Carbon Border Adjustment Mechanism (CBAM), or a carbon tax on imports designed to prevent “carbon leakage,” a situation in which companies move production of emissions intensive goods to countries with less stringent environmental and climate policies. Carney also pledged to introduce incentives for green buildings and transport electrification, and for consumer investments such as home retrofits and heat pump installations.\nIn a presentation announcing the elimination of the consumer carbon tax, Carney said:\n“This will make a difference to hard-pressed Canadians, but it is part of a much bigger set of measures that this government is taking to ensure that we fight against climate change, that our companies are competitive, and the country moves forward.”",
        "mention_count":0,
        "relevant_paragraphs":[

        ],
        "esg_theme_counts":{
            "environmental":20,
            "social":0,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "carbon",
                "climate",
                "green",
                "net zero",
                "emissions"
            ],
            "social":[

            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":1.0,
        "sentiment":"positive",
        "positive_words":2,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"Senate Republicans Launch Legislation to Shield U.S. Companies from EU Sustainability Due Diligence Rules",
        "date":"March 13, 2025",
        "link":"https:\/\/www.esgtoday.com\/senate-republicans-launch-legislation-to-shield-u-s-companies-from-eu-sustainability-due-diligence-rules\/",
        "excerpt":"Excerpt not available",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"blackrock",
        "categories":[

        ],
        "full_content":"U.S. Senator and Senate Banking Committee member Bill Hagerty announced the introduction of the “PROTECT USA” Act, proposing new legislation aimed at shielding U.S. companies from having to comply with the EU’s Corporate Sustainability Due Diligence Directive (CSDDD).\nThe CSDDD sets out obligations for companies to identify, assess, prevent, mitigate, address and remedy impacts on people and planet – ranging from child labor and slavery to pollution and emissions, deforestation and damage to ecosystems – in their upstream supply chain and some downstream activities such as distribution and recycling.\nThe legislation was adopted in May 2024, but as part of the European Commission’s Omnibus process faces proposed changes, including a delay to its implementation, and a narrower scope to require companies to only perform sustainability due diligence at the level of direct business partners.\nUnder the new proposed U.S. legislation, U.S. companies in several sectors including agriculture, mining, energy, timber, and manufacturing would be prohibited from being forced to comply with the CSDDD or any foreign sustainability due diligence regulation, judgements by foreign courts in relation to such regulation would not be recognized. The proposal would also block any adverse actions taken against companies in relation to the regulations.\nSenator Hagerty said:\n“American companies should be governed by U.S. laws, not unaccountable lawmakers in foreign capitals. The European Union’s ideologically motivated regulatory overreach is an affront to U.S. sovereignty. I will use every tool at my disposal to block it.”\nThe introduction of the legislation follows the publication of a letter by the Senate Banking Committee Chairman to Trump administration officials in February expressing concerns about the potential impact of the EU’s CSDDD regulation on U.S. companies, and urging the administration to “engage with European counterparts to vocalize direct opposition and encourage an indefinite pause on its implementation.”",
        "mention_count":0,
        "relevant_paragraphs":[

        ],
        "esg_theme_counts":{
            "environmental":3,
            "social":1,
            "governance":1
        },
        "esg_keywords":{
            "environmental":[
                "emissions",
                "recycling",
                "pollution"
            ],
            "social":[
                "labor"
            ],
            "governance":[
                "regulatory"
            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":-1.0,
        "sentiment":"negative",
        "positive_words":0,
        "negative_words":1,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"UK Plans Levy on Jet Fuel Producers to Fund Sustainable Aviation Fuel “Revenue Certainty Mechanism”",
        "date":"March 10, 2025",
        "link":"https:\/\/www.esgtoday.com\/uk-plans-levy-on-jet-fuel-producers-to-fund-revenue-certainty-mechanism-for-sustainable-aviation-fuel-development\/",
        "excerpt":"Excerpt not available",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"blackrock",
        "categories":[

        ],
        "full_content":"The UK Government’s Department for Transport announced the launch of a new consultation on an initiative aimed at supporting producers of sustainable aviation fuel (SAF) through the establishment of a “revenue certainty mechanism” (RCM) to be funded by jet-fuel suppliers.\nFuel accounts for the vast majority of the aviation sector’s emissions. Generally produced from sustainable resources, like waste oils and agricultural residues, SAF is seen as one of the key tools to help decarbonize the aviation industry in the near- to medium-term. SAF producers estimate the fuels can result in lifecycle GHG emissions reductions of as much as 85% relative to conventional fuels.\nThe new consultation follows the launch in January by the government of the SAF Mandate, requiring the introduction of sustainable aviation fuel (SAF) in the UK’s jet fuel mix, starting at 2% in 2025, and ramping up to 22% by 2040.\nEfforts to meaningfully increase the use of SAF by airlines face significant challenges, including the low supply currently available on the market, and prices well above those of conventional fossil-based fuels.\nAmong the key barriers to ramping up SAF production is the high start-up cost, with the government estimating investments of £600 million to £2 billion for new commercial plants to reach economies of scale, with new plants struggling to secure investments due to risks such as revenue uncertainty and fluctuating fuel prices.\nAccording to the Department for Transport, the new RCM plan will help to reduce risk by introducing an industry funded price guarantee to ensure steady income flow for producers, even if SAF prices fluctuate, and giving investors confidence to invest in SAF plants in the UK.\nThe consultation outlines the government’s position that the RCM should be funded by industry, with a preferred approach to introduce a variable levy on suppliers of jet fuel. The proposal follows the “polluter pays principle” for hard to abate sectors, and is consistent with existing schemes for renewable electricity and hydrogen. The government stated that the mechanism allows the cost to be spread across the supply chain, ensuring that it is borne by those benefiting from the supply of fossil aviation fuel.\nAviation Minister, Mike Kane, said:\n“We are committed to building the technology and fuel supply that will see greener flying become a reality in a way that protects consumers.\n“As part of our Plan for Change, these proposals will power up SAF production in the UK, support thousands of green jobs and bolster expansion plans.”\nThe consultation will run until the end of March, with plans for a Sustainable Aviation Fuel (Revenue Support Mechanism) Bill to be brought to Parliament in the Spring. Click here to access the consultation.",
        "mention_count":0,
        "relevant_paragraphs":[

        ],
        "esg_theme_counts":{
            "environmental":10,
            "social":0,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "green",
                "ghg",
                "renewable",
                "waste",
                "emissions",
                "sustainable"
            ],
            "social":[

            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":0.6,
        "sentiment":"positive",
        "positive_words":4,
        "negative_words":1,
        "quotes":[

        ],
        "quote_count":0
    }
]