[
    {
        "title":"Microsoft, CalSTRS Back $175 Million Natural Climate Solutions Strategy by Just Climate",
        "date":"March 18, 2025",
        "link":"https:\/\/www.esgtoday.com\/microsoft-calstrs-back-175-million-natural-climate-solutions-strategy-by-just-climate\/",
        "excerpt":"Climate solutions-focused investment business Just Climate announced that it has raised $175 million for its […]",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"microsoft",
        "categories":[

        ],
        "full_content":"Climate solutions-focused investment business Just Climate announced that it has raised $175 million for its Natural Climate Solutions strategy, aimed at directing capital to businesses focused on natural climate solutions to transform land use to achieve global net-zero and nature positive goals, while also delivering attractive returns.\nInvestors backing the strategy include California State Teachers’ Retirement System (CalSTRS) as institutional anchor, and Microsoft’s Climate Innovation Fund as corporate anchor.\nFounded in 2021 by Generation Investment Management, a sustainability-focused investment firm chaired by former U.S. Vice President Al Gore, Just Climate aims to deliver impact by focusing on scaling solutions for the highest-emitting, most off-track sectors of the economy, investing in climate solutions that can radically reduce or remove emissions, while generating attractive risk-adjusted financial returns.\nThe firm unveiled the Natural Climate Solutions strategy in September 2023, led by Co-Chief Investment Officer Eduardo Mufarej. The strategy is designed to support entrepreneurs with growth capital and business building support to scale solutions to help transform the way agricultural commodities are produced and to restore degraded landscapes, such as biological fertilizers and pesticides to replace chemicals, as well as development models to finance and operate restoration projects, and technologies to verify carbon and biodiversity outcomes.\nJust Climate has grown its Natural Climate Solutions team to 12 investment professionals, based in London, San Francisco and São Paulo. The strategy recently announced its first investment, leading a $25 million Series B capital raise for biodiversity measurement and monitoring solution provider NatureMetrics in January 2025.\nMufarej said:\n“We believe a rapid land transition, with the potential to be as profound as the energy transition, is coming. Our strategy focuses on directing and scaling institutional capital to solutions that can help to transform food systems and drive the expansion of the ecosystem restoration sector. “\nMicrosoft and CalSTRS both also backed Just Climate’s $1.5 billion Industrial Climate Solutions strategy, with Microsoft’s Climate Innovation Fund as an anchor investor. Microsoft is a also founding member of the Just Climate Nature Alliance, a group of corporate leaders whose influence and expertise is expected to play a vital role in expanding the natural climate solutions investment opportunity.\nErika Basham, Director at Microsoft’s Climate Innovation Fund, said:\n“Our work with Just Climate and participation in the Just Climate Nature Alliance reflect our commitment to advancing nature-based solutions that drive high-integrity carbon removals, build resilient supply chains and protect biodiversity.”",
        "mention_count":5,
        "relevant_paragraphs":[
            "Investors backing the strategy include California State Teachers’ Retirement System (CalSTRS) as institutional anchor, and Microsoft’s Climate Innovation Fund as corporate anchor.",
            "Microsoft and CalSTRS both also backed Just Climate’s $1.5 billion Industrial Climate Solutions strategy, with Microsoft’s Climate Innovation Fund as an anchor investor. Microsoft is a also founding member of the Just Climate Nature Alliance, a group of corporate leaders whose influence and expertise is expected to play a vital role in expanding the natural climate solutions investment opportunity.",
            "Erika Basham, Director at Microsoft’s Climate Innovation Fund, said:"
        ],
        "esg_theme_counts":{
            "environmental":24,
            "social":0,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "carbon",
                "climate",
                "biodiversity",
                "emissions"
            ],
            "social":[

            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":1.0,
        "sentiment":"positive",
        "positive_words":7,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"Microsoft Signs 30-Year Carbon Removal Afforestation Deal in India",
        "date":"March 6, 2025",
        "link":"https:\/\/www.esgtoday.com\/microsoft-signs-30-year-carbon-removal-afforestation-deal-in-india\/",
        "excerpt":"Microsoft, carbon markets solutions provider Climate Impact Partners, and climate-focused project finance business Terra Natural […]",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"microsoft",
        "categories":[

        ],
        "full_content":"Microsoft, carbon markets solutions provider Climate Impact Partners, and climate-focused project finance business Terra Natural Capital announced today a new finance and carbon removal purchase agreement, aimed at supporting the development of a large-scale afforestation project in India.\nAs part of the agreement, Microsoft will will purchase 1.5 million tonnes of verified carbon removal credits over 30 years, representing 50% of the project’s projected 3 million tonne output.\nThe new agreement brings together project development expertise from Climate Impact Partners, finance from Terra Natural Capital, and a long-term purchase commitment from Microsoft, supporting the Panna afforestation project in the Madhya Pradesh State, India. The project, spanning 20,000 hectares, will see up to 11.6 million mixed native trees planted across farmer and community land.\nErica Vertefeuille, Managing Director, Terra Natural Capital said:\n“This transaction reflects the power of collaboration between trusted project developers, corporate demand, and innovative finance to unlock climate impact. We recognize that access to project finance is a critical need for the carbon removal market to scale and are committed to providing long-term capital that will accelerate project development and empower corporates to achieve their climate targets.”\nThe agreement marks Microsoft’s first carbon removal purchase in India for Microsoft, and forms part of the tech giant’s rapidly expanding carbon credit portfolio, part of the company’s initiative to become carbon negative by 2030. The portfolio includes several large-scale afforestation and reforestation-based agreements, including a 7 million ton deal announced in January with Chestnut Carbon, in addition to technologies including, ocean-based carbon removal, and biochar-based projects, and direct air capture (DAC) agreements.\nBrian Marrs, Senior Director Energy Markets, Microsoft said:\n“At Microsoft, we believe that high-quality, nature-based solutions are vital to addressing climate change. Panna forms an important part of our growing portfolio of carbon removal projects – our first in India and largest in the APAC region. The collaboration with Climate Impact Partners helps to ensure that millions more trees are planted, more carbon is removed from the atmosphere, more jobs are created, and more finance flows back to local communities.”\nIn addition to the carbon removal, the companies highlighted other key benefits of the project, including economic empowerment through a share of carbon credit sales to farmers and income generation from the sale of fruit and medicinal produce from the trees planted, training programs on climate-smart agricultural techniques to help enhance long-term yields, the implementation of large-scale water infrastructure to capture and conserve water, and improved biodiversity by focusing on native species and attracting butterfly and bird species back to currently degraded lands.\nSheri Hickok, CEO, Climate Impact Partners said:\n“By securing a long-term supply of high-quality carbon credits, this model empowers companies like Microsoft to meet their ambitious climate targets, drive growth in the carbon removal market, and bring benefits to communities most impacted by climate change. Panna exemplifies how companies can help scale large-scale carbon removal infrastructure.”",
        "mention_count":8,
        "relevant_paragraphs":[
            "Microsoft, carbon markets solutions provider Climate Impact Partners, and climate-focused project finance business Terra Natural Capital announced today a new finance and carbon removal purchase agreement, aimed at supporting the development of a large-scale afforestation project in India.",
            "As part of the agreement, Microsoft will will purchase 1.5 million tonnes of verified carbon removal credits over 30 years, representing 50% of the project’s projected 3 million tonne output.",
            "The new agreement brings together project development expertise from Climate Impact Partners, finance from Terra Natural Capital, and a long-term purchase commitment from Microsoft, supporting the Panna afforestation project in the Madhya Pradesh State, India. The project, spanning 20,000 hectares, will see up to 11.6 million mixed native trees planted across farmer and community land.",
            "The agreement marks Microsoft’s first carbon removal purchase in India for Microsoft, and forms part of the tech giant’s rapidly expanding carbon credit portfolio, part of the company’s initiative to become carbon negative by 2030. The portfolio includes several large-scale afforestation and reforestation-based agreements, including a 7 million ton deal announced in January with Chestnut Carbon, in addition to technologies including, ocean-based carbon removal, and biochar-based projects, and direct air capture (DAC) agreements.",
            "Brian Marrs, Senior Director Energy Markets, Microsoft said:",
            "“At Microsoft, we believe that high-quality, nature-based solutions are vital to addressing climate change. Panna forms an important part of our growing portfolio of carbon removal projects – our first in India and largest in the APAC region. The collaboration with Climate Impact Partners helps to ensure that millions more trees are planted, more carbon is removed from the atmosphere, more jobs are created, and more finance flows back to local communities.”",
            "“By securing a long-term supply of high-quality carbon credits, this model empowers companies like Microsoft to meet their ambitious climate targets, drive growth in the carbon removal market, and bring benefits to communities most impacted by climate change. Panna exemplifies how companies can help scale large-scale carbon removal infrastructure.”"
        ],
        "esg_theme_counts":{
            "environmental":28,
            "social":1,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "carbon",
                "climate",
                "biodiversity"
            ],
            "social":[
                "community"
            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":0.5,
        "sentiment":"positive",
        "positive_words":3,
        "negative_words":1,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"Microsoft Signs Deal to Deploy Renewable Energy in Underinvested Communities",
        "date":"February 27, 2025",
        "link":"https:\/\/www.esgtoday.com\/microsoft-signs-deal-to-deploy-renewable-energy-in-underinvested-communities\/",
        "excerpt":"Microsoft has signed an agreement with carbon solution firm Clearloop for the deployment of up […]",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"microsoft",
        "categories":[

        ],
        "full_content":"Microsoft has signed an agreement with carbon solution firm Clearloop for the deployment of up to 100 megawatts of renewable energy projects, aimed at bringing clean energy to disadvantaged communities.\nThe new projects will be deployed over the next three years, and will expand access to clean energy and drive economic development in about 20 American communities with carbon-intense grids, Clearloop said, while helping Microsoft meet its carbon reduction goals\nThe new projects will provide solar energy for communities in Arkansas and Louisiana, diversifying the energy mix in those states and preventing more than 5 million metric tons of carbon from entering the atmosphere over the next four decades, Clearloop said. Studies show that solar accounts for just 1.3% of the energy mix in Arkansas, and 0.3% in Louisiana, both well below the US average of 4.0%, industry experts said.\nBy matching customer electricity usage with new renewable energy generation, Microsoft will be able to take advantage of emission offsets. This will help support Microsoft’s goal of becoming carbon negative by 2030.\nDanielle Decatur, Microsoft Director of Environmental Justice, said:\n“Clearloop helps Microsoft achieve its carbon negative goals by supporting renewable energy projects in communities across the country that might otherwise miss out on the economic and environmental benefits of the energy transition.”\nClearloop helps create solutions for organizations to decarbonize the economy and accelerate the development of new solar projects in American communities where significant economic and environmental benefits can be achieved.  Working with environmental tech nonprofit WattTime, Nashville-based Clearloop was an early pioneer of using emissions factors to identify strategic points on the grid where new solar generation can significantly accelerate decarbonization and expand equitable access to clean energy.\nThe first four solar projects in the multi-year agreement are set to break ground over the next few months and will be operational by year’s end, the companies said. These will be among the first large-scale solar projects interconnecting and serving the local distribution grids in Poinsett County, Cross County, and Desha County in Arkansas, as well as Bienville Parish in Louisiana.\nAs part of this agreement with Microsoft, Clearloop will create a Community Benefits Fund, managed by nonprofit Sustain Our Future Foundation, to support positive outcomes for local communities impacted by unhealthy social and environmental conditions.\nLaura Zapata, Clearloop CEO and Co-founder, said:\n“We applaud Microsoft for using its purchasing power to pilot and scale innovative structures that accelerate grid decarbonization in a way that ensures all American communities can see themselves represented as we transform our economy with clean, innovative technologies. Community-centric climate action by forward-thinking companies like Microsoft—recognizing that not all megawatt hours have the same carbon impact—are making access to carbon-free energy by more Americans possible.”",
        "mention_count":9,
        "relevant_paragraphs":[
            "Microsoft has signed an agreement with carbon solution firm Clearloop for the deployment of up to 100 megawatts of renewable energy projects, aimed at bringing clean energy to disadvantaged communities.",
            "The new projects will be deployed over the next three years, and will expand access to clean energy and drive economic development in about 20 American communities with carbon-intense grids, Clearloop said, while helping Microsoft meet its carbon reduction goals",
            "By matching customer electricity usage with new renewable energy generation, Microsoft will be able to take advantage of emission offsets. This will help support Microsoft’s goal of becoming carbon negative by 2030.",
            "Danielle Decatur, Microsoft Director of Environmental Justice, said:",
            "“Clearloop helps Microsoft achieve its carbon negative goals by supporting renewable energy projects in communities across the country that might otherwise miss out on the economic and environmental benefits of the energy transition.”",
            "As part of this agreement with Microsoft, Clearloop will create a Community Benefits Fund, managed by nonprofit Sustain Our Future Foundation, to support positive outcomes for local communities impacted by unhealthy social and environmental conditions.",
            "“We applaud Microsoft for using its purchasing power to pilot and scale innovative structures that accelerate grid decarbonization in a way that ensures all American communities can see themselves represented as we transform our economy with clean, innovative technologies. Community-centric climate action by forward-thinking companies like Microsoft—recognizing that not all megawatt hours have the same carbon impact—are making access to carbon-free energy by more Americans possible.”"
        ],
        "esg_theme_counts":{
            "environmental":13,
            "social":2,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "renewable",
                "carbon",
                "climate",
                "emissions"
            ],
            "social":[
                "community"
            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":0.0,
        "sentiment":"neutral",
        "positive_words":2,
        "negative_words":2,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"Microsoft CSO Says AI Widens Gap – and Offers Solutions – to Meeting Climate Goals",
        "date":"February 20, 2025",
        "link":"https:\/\/www.esgtoday.com\/microsoft-cso-says-ai-widens-gap-and-offers-solutions-to-meeting-climate-goals\/",
        "excerpt":"The rapid growth of artificial intelligence (AI) over the past few years has created challenges […]",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"microsoft",
        "categories":[

        ],
        "full_content":"The rapid growth of artificial intelligence (AI) over the past few years has created challenges for Microsoft in achieving its “moonshot” sustainability goals, including its target to become carbon negative by 2030, with the company’s Chief Sustainability Officer Melanie Nakagawa acknowledging that “the moon has gotten further away.”\nIn a blog post discussing Microsoft’s progress towards its 2030 targets, however, Nakagawa reiterated that the company remains committed to its climate goals, and said that while AI presented sustainability challenges, it will also form the basis of the solutions needed to achieve climate ambitions.\nNakagawa said:\n“Already, we are seeing AI make a positive impact on the planet, and in the coming years, this technology will begin to rapidly accelerate climate solutions at a scale we’ve not yet seen.”\nMicrosoft launched a series of moonshot sustainability goals in 2020, including commitments to become carbon negative, water positive and zero waste by 2030, as well as to protect more land than it uses by that date.\nIn the company’s environmental sustainability report released last year, however, Microsoft revealed that its Scope 3 emissions, which account for the vast majority of the company’s carbon footprint, were actually more than 30% higher in 2023 than in 2020, driven largely by significant growth in data centers to meet increasing demand for AI computing power. Microsoft has since announced a series of measures to help address its value chain emissions footprint, including introducing a policy for some of its key suppliers to use 100% carbon-free electricity, and launching a new supplier decarbonization team focused on tackling emissions from cloud and AI operations.\nIn her post, Nakagawa highlights some of the Microsoft’s key achievements towards reaching its 2030 goals, including becoming one of the world’s largest carbon-free energy buyers with a 34 GW renewable energy portfolio spanning 24 countries, growing its water replenishment portfolio to 90 projects in over 40 locations, improving the repairability of its hardware products, and surpassing its land protection goal by more than 40%.\nDespite the achievements, however, Nakagawa said that “we know that our work is far from over, and that the path ahead has gotten harder,” and adding that “the world is not on track to meet critical climate goals and we see many of these challenges reflected in our own journey.”\nNakagawa’s post also indicated a key shift in Microsoft’s climate strategy. Microsoft introduced a carbon fee in 2012, charged to business groups within the company based on their emissions footprint – and extended to cover all Scope 3 emissions in 2020 – to help fund the company’s carbon neutrality commitment. In her post, Nakagawa said that stopped using proceeds from the fee to purchase unbundled renewable energy certificates, refocusing instead “on more long-term, higher-impact investments,” including carbon reduction, carbon removal and procuring clean electricity.\nNakagawa said:\n“We are proud to continue making decisions that drive positive environmental impact in the market and deliver high-integrity investments. We remain resolute in our commitment to our climate goals and to empowering others with the technology needed to build a more sustainable future.”\nNakagawa joined Microsoft as CSO in early 2023, after serving in the Biden administration White House as Special Assistant to the President and Senior Director for Climate and Energy on the National Security Council, where she played a leadership role on international and domestic climate initiatives, including working on the U.S.’ return to the Paris Agreement, and on energy issues including the international energy response to the war in Ukraine.\nClick here to access Microsoft Chief Sustainability Officer Melanie Nakagawa’s blog post.",
        "mention_count":10,
        "relevant_paragraphs":[
            "The rapid growth of artificial intelligence (AI) over the past few years has created challenges for Microsoft in achieving its “moonshot” sustainability goals, including its target to become carbon negative by 2030, with the company’s Chief Sustainability Officer Melanie Nakagawa acknowledging that “the moon has gotten further away.”",
            "In a blog post discussing Microsoft’s progress towards its 2030 targets, however, Nakagawa reiterated that the company remains committed to its climate goals, and said that while AI presented sustainability challenges, it will also form the basis of the solutions needed to achieve climate ambitions.",
            "Microsoft launched a series of moonshot sustainability goals in 2020, including commitments to become carbon negative, water positive and zero waste by 2030, as well as to protect more land than it uses by that date.",
            "In the company’s environmental sustainability report released last year, however, Microsoft revealed that its Scope 3 emissions, which account for the vast majority of the company’s carbon footprint, were actually more than 30% higher in 2023 than in 2020, driven largely by significant growth in data centers to meet increasing demand for AI computing power. Microsoft has since announced a series of measures to help address its value chain emissions footprint, including introducing a policy for some of its key suppliers to use 100% carbon-free electricity, and launching a new supplier decarbonization team focused on tackling emissions from cloud and AI operations.",
            "In her post, Nakagawa highlights some of the Microsoft’s key achievements towards reaching its 2030 goals, including becoming one of the world’s largest carbon-free energy buyers with a 34 GW renewable energy portfolio spanning 24 countries, growing its water replenishment portfolio to 90 projects in over 40 locations, improving the repairability of its hardware products, and surpassing its land protection goal by more than 40%.",
            "Nakagawa’s post also indicated a key shift in Microsoft’s climate strategy. Microsoft introduced a carbon fee in 2012, charged to business groups within the company based on their emissions footprint – and extended to cover all Scope 3 emissions in 2020 – to help fund the company’s carbon neutrality commitment. In her post, Nakagawa said that stopped using proceeds from the fee to purchase unbundled renewable energy certificates, refocusing instead “on more long-term, higher-impact investments,” including carbon reduction, carbon removal and procuring clean electricity.",
            "Nakagawa joined Microsoft as CSO in early 2023, after serving in the Biden administration White House as Special Assistant to the President and Senior Director for Climate and Energy on the National Security Council, where she played a leadership role on international and domestic climate initiatives, including working on the U.S.’ return to the Paris Agreement, and on energy issues including the international energy response to the war in Ukraine.",
            "Click here to access Microsoft Chief Sustainability Officer Melanie Nakagawa’s blog post."
        ],
        "esg_theme_counts":{
            "environmental":27,
            "social":0,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "carbon",
                "climate",
                "carbon footprint",
                "renewable",
                "waste",
                "emissions",
                "sustainable"
            ],
            "social":[

            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":0.82,
        "sentiment":"positive",
        "positive_words":10,
        "negative_words":1,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"Microsoft Sources Renewable Energy from New U.S. Solar Projects in Texas, Illinois",
        "date":"February 12, 2025",
        "link":"https:\/\/www.esgtoday.com\/microsoft-purchases-389-mw-of-renewable-energy-from-new-u-s-solar-projects-with-edp\/",
        "excerpt":"Clean energy developer EDP Renewables North America (EDPR NA) announced the delivery of three new […]",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"microsoft",
        "categories":[

        ],
        "full_content":"Clean energy developer EDP Renewables North America (EDPR NA) announced the delivery of three new solar projects in Illinois and Texas totalling 400 MW, with Microsoft purchasing 389 MW of electricity and renewable energy credits (RECs) from the projects through long-term virtual power purchase agreements (VPPAs).\nThe three new projects include the 140 MW Wolf Run Solar Project, and the 110 MW Hickory Solar Project both located in southern Illinois, and the 150 MW Cattlemen II Solar Project located near Austin, Texas.\nThe two Illinois projects created 500 construction jobs the companies said. The projects have also contributed $4.8 million to landowners, who lease a portion of their land to the projects, and millions of dollars to local governments through tax payments. Those payments, the companies said, ensure that critical services, schools, road maintenance, and other local initiatives are well-funded. The companies added that Cattlemen II in Texas will also contribute millions in taxes, benefiting the local school district and local government. That project created approximately 300 construction jobs.\nThe operations of these three projects will continue to increase local spending at service providers, restaurants, hotels, and other retailers near the project communities, with more than $10.4 million spent to date during construction, the companies added.\nSandhya Ganapathy, CEO of EDP Renewables North America, said:\n“The importance of ensuring benefits flowing from renewable energy development directly into communities has never been more important. Through these three additional projects, we’re keeping our promise – and indeed the industry’s promise – to contribute to the nation’s growing energy demand and in that process invest in long-lasting economic growth of our communities.”\nFor the Hickory project, EDPR NA and Microsoft used an Environmental Justice PPA (EJ PPA), developed by Microsoft and Volt Energy Utility, LLC (Volt Energy Utility), a minority-owned renewable energy developer focused on making clean energy investments in communities disproportionately impacted by pollution and vulnerable to the impacts of climate change.\nWith the EJ PPA, Hickory will contribute funding to enable Sharing the Power Foundation, a non-profit that seeks to advance environmental justice and contribute to an equitable distribution of benefits produced by the clean energy economy. The funding will help provide financial assistance to organizations and causes that ensure equal access to clean air, water, and renewable energy, as well as offer availability to energy assistance programs and opportunities to pursue workforce training in clean energy careers.\nThe companies said that in addition to providing clean energy and economic growth, the projects will also support Microsoft’s sustainability and carbon reduction goals. In 2021, Microsoft launched a “100\/100\/0 clean energy goal,” with the company targeting having 100% of its electricity consumption, 100% percent of the time, matched by purchases from zero carbon energy sources by 2030, adding to its prior commitment to use 100% renewable energy in its buildings and datacenters globally by 2025. Microsoft has also committed to become carbon negative by 2030, and to cover 100% of its electricity consumption in its buildings and datacenters globally with renewable energy by 2025.\nKourtney Nelson, Senior Director of Renewable Energy Procurement at Microsoft, said:\n“It’s exciting when projects achieve commercial operations and begin generating clean energy in support of grid decarbonization. We’re pleased with EDPR NA and Volt Energy Utility’s collaboration on Hickory and the positive impact the project will have with community grants and investing in future renewable energy leaders.”\n ",
        "mention_count":7,
        "relevant_paragraphs":[
            "Clean energy developer EDP Renewables North America (EDPR NA) announced the delivery of three new solar projects in Illinois and Texas totalling 400 MW, with Microsoft purchasing 389 MW of electricity and renewable energy credits (RECs) from the projects through long-term virtual power purchase agreements (VPPAs).",
            "For the Hickory project, EDPR NA and Microsoft used an Environmental Justice PPA (EJ PPA), developed by Microsoft and Volt Energy Utility, LLC (Volt Energy Utility), a minority-owned renewable energy developer focused on making clean energy investments in communities disproportionately impacted by pollution and vulnerable to the impacts of climate change.",
            "The companies said that in addition to providing clean energy and economic growth, the projects will also support Microsoft’s sustainability and carbon reduction goals. In 2021, Microsoft launched a “100\/100\/0 clean energy goal,” with the company targeting having 100% of its electricity consumption, 100% percent of the time, matched by purchases from zero carbon energy sources by 2030, adding to its prior commitment to use 100% renewable energy in its buildings and datacenters globally by 2025. Microsoft has also committed to become carbon negative by 2030, and to cover 100% of its electricity consumption in its buildings and datacenters globally with renewable energy by 2025.",
            "Kourtney Nelson, Senior Director of Renewable Energy Procurement at Microsoft, said:"
        ],
        "esg_theme_counts":{
            "environmental":13,
            "social":2,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "renewable",
                "carbon",
                "climate",
                "pollution"
            ],
            "social":[
                "community",
                "workforce"
            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":0.67,
        "sentiment":"positive",
        "positive_words":5,
        "negative_words":1,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"EY, Microsoft Social Impact Collaboration Launches AI Skills Training Program",
        "date":"February 4, 2025",
        "link":"https:\/\/www.esgtoday.com\/ey-microsoft-social-impact-collaboration-launches-ai-skills-training-program\/",
        "excerpt":"Global professional services firm EY and tech giant Microsoft announced the launch of AI Skills Passport […]",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"microsoft",
        "categories":[

        ],
        "full_content":"Global professional services firm EY and tech giant Microsoft announced the launch of AI Skills Passport (AISP), a new free program aimed at addressing the Artificial Intelligence (AI) skills gap by providing young people with employable AI experience.\nThe new program forms part of a social impact collaboration announced between EY and Microsoft in 2022 aimed at upskilling young people and supporting the entry or re-entry of millions of people into the workforce or to build new businesses, with a focus on sustainability, science, technology, engineering and mathematics (STEM). The social impact initiative aims to positively influence more than five million lives by 2025.\nAccording to EY and Microsoft, the new program comes as research indicates that demand for AI skills in job postings has surged by 2,000%, while a recent EY and TeachAI survey, with support from Microsoft, indicated that the vast majority of Gen Z respondents did not feel fully satisfied with the preparation provided by their schools or employers for the implications and use of AI.\nGillian Hinde, EY Global Corporate Responsibility Leader, said:\n“The EY and Microsoft collaboration is a powerful example of how organizations can come together to help drive meaningful social change and help shape the future with confidence. The AI Skills Passport program aims to equip young people and underserved communities with the AI experience needed to thrive in today’s digital age, while also sharing the skills necessary for tomorrow.”\nThe new program, targeted at students aged 16 and older, includes a free online 10-hour course, covering topics including the fundamentals of AI, ethical considerations and its applications across business, sustainability and technology careers, assisting students in learning about AI technologies, working with them, and applying them to various industries and careers. Students completing the course will receive a co-branded EY and Microsoft certificate of completion to help strengthen resumes, as well as access to a database of websites and resources to search for additional learning or employment opportunities.\nEY and Microsoft said that the new program has been activated in countries including the U.S., UK, India, Italy, Greece, Belgium, South Africa, Ireland, Switzerland, Cyprus, Australia, New Zealand, Fiji, Papua New Guinea, Sweden, and China, with plans to roll out additional countries through 2025, and to translate the program to five languages.\nKate Behncken, Global Head of Microsoft Philanthropies, said:\n“Through this new initiative with EY, we’re helping young people build the AI skills they need to succeed in the evolving AI economy. By bridging the gap between education and employability, we’re creating opportunities for the next generation to contribute, innovate, and thrive in the new AI economy.”\nThe new program follows the launch in 2023 by EY and Microsoft as part of the social impact initiative of Green Skills Passport, a free online education program aimed at equipping young people with skills to gain sustainability skills to find green jobs and pursue green economy opportunities.",
        "mention_count":9,
        "relevant_paragraphs":[
            "Global professional services firm EY and tech giant Microsoft announced the launch of AI Skills Passport (AISP), a new free program aimed at addressing the Artificial Intelligence (AI) skills gap by providing young people with employable AI experience.",
            "The new program forms part of a social impact collaboration announced between EY and Microsoft in 2022 aimed at upskilling young people and supporting the entry or re-entry of millions of people into the workforce or to build new businesses, with a focus on sustainability, science, technology, engineering and mathematics (STEM). The social impact initiative aims to positively influence more than five million lives by 2025.",
            "According to EY and Microsoft, the new program comes as research indicates that demand for AI skills in job postings has surged by 2,000%, while a recent EY and TeachAI survey, with support from Microsoft, indicated that the vast majority of Gen Z respondents did not feel fully satisfied with the preparation provided by their schools or employers for the implications and use of AI.",
            "“The EY and Microsoft collaboration is a powerful example of how organizations can come together to help drive meaningful social change and help shape the future with confidence. The AI Skills Passport program aims to equip young people and underserved communities with the AI experience needed to thrive in today’s digital age, while also sharing the skills necessary for tomorrow.”",
            "The new program, targeted at students aged 16 and older, includes a free online 10-hour course, covering topics including the fundamentals of AI, ethical considerations and its applications across business, sustainability and technology careers, assisting students in learning about AI technologies, working with them, and applying them to various industries and careers. Students completing the course will receive a co-branded EY and Microsoft certificate of completion to help strengthen resumes, as well as access to a database of websites and resources to search for additional learning or employment opportunities.",
            "EY and Microsoft said that the new program has been activated in countries including the U.S., UK, India, Italy, Greece, Belgium, South Africa, Ireland, Switzerland, Cyprus, Australia, New Zealand, Fiji, Papua New Guinea, Sweden, and China, with plans to roll out additional countries through 2025, and to translate the program to five languages.",
            "Kate Behncken, Global Head of Microsoft Philanthropies, said:",
            "The new program follows the launch in 2023 by EY and Microsoft as part of the social impact initiative of Green Skills Passport, a free online education program aimed at equipping young people with skills to gain sustainability skills to find green jobs and pursue green economy opportunities."
        ],
        "esg_theme_counts":{
            "environmental":3,
            "social":5,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "green"
            ],
            "social":[
                "ethical",
                "social impact",
                "workforce"
            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"social",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":1.0,
        "sentiment":"positive",
        "positive_words":1,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"Microsoft Inks 7 Million Ton Nature-Based Carbon Removal Megadeal",
        "date":"January 31, 2025",
        "link":"https:\/\/www.esgtoday.com\/microsoft-inks-7-million-ton-nature-based-carbon-removal-megadeal\/",
        "excerpt":"Microsoft and nature-based carbon removal startup Chestnut Carbon announced today a new 25-year offtake agreement, […]",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"microsoft",
        "categories":[

        ],
        "full_content":"Microsoft and nature-based carbon removal startup Chestnut Carbon announced today a new 25-year offtake agreement, with Chestnut providing Microsoft with more than 7 million tons of nature-based carbon removal credits, generated from its forest projects in the Southern U.S.\nThe deal marks the largest-ever voluntary corporate investment in conservation forestry in the U.S., according to Chestnut Carbon, restoring approximately 60,000 acres of land, and planting more than 35 million native, biodiverse hardwood and softwood trees.\nLaunched in 2022 by energy sector-focused alternative asset manager Kimmeridge, Chestnut helps reduce carbon emissions by planting and developing long-term forest projects that create biodiverse ecosystems and community benefits. Chestnut’s projects acquire marginal crop and pasture lands, and partners with local foresters, nurseries, and community members to develop an ideal forest ecosystem based on native tree species, soil, drainage, and community land use.\nThe new agreement will provide carbon removal credits from Chestnut’s afforestation, reforestation, and revegetation (ARR) project in Arkansas, Texas, and Louisiana. Key features of the project highlighted by Chestnut included the durability of its carbon sequestration, and additionality, with the lands not being restored in the absence of the carbon market, as well as environmental and stakeholder benefits such as improvements to native wildlife habitats, air and water quality, expansion of land use alternatives, community engagement and economic development.\nAccording to Chestnut, the new agreement with Microsoft will enable it to grow its ARR portfolio to 500,000 acres by 2030 and to remove 100 million tons of CO2 from the atmosphere over a 50-year crediting period.\nBen Dell, CEO of Chestnut and Managing Partner of Kimmeridge, said:\n“We’re excited to be expanding our collaboration with Microsoft given their market leadership in net zero commitments and the signing of a second agreement within the span of a year reaffirms their view that Chestnut is delivering high quality removal credits. We’re confident in our belief that nature-based afforestation solutions are the most attractive, scalable, and cost-effective means for removing carbon from the atmosphere today. We continue to bring high-quality credits to market for discerning customers and look forward to building on our leading position in the market.”\nThe new transaction adds to an initial 15-year agreement between Microsoft and Chestnut in December 2023 for up to 3 million tons of carbon credits, and marks a further expansion to Microsoft’s diverse portfolio of carbon removal projects, forming part of the tech giant’s initiative to become carbon negative by 2030. The portfolio includes several large-scale reforestation-based agreements, including a 3.5 million ton deal announced earlier this month with Brazil-based re.green, in addition to technologies including, ocean-based carbon removal, and biochar-based projects, and direct air capture (DAC) agreements.\nBrian Marrs, Senior Director of Energy & Carbon Removal at Microsoft, said:\n“This agreement with Chestnut Carbon is another positive step towards Microsoft’s goal to become carbon negative by 2030. We look forward to the prospect of scaling forest restoration within the United States, attracting sophisticated private capital in the process. We are glad to see the Sustainable Restoration Project diversify the ecological impact of our global carbon removal portfolio.”",
        "mention_count":8,
        "relevant_paragraphs":[
            "Microsoft and nature-based carbon removal startup Chestnut Carbon announced today a new 25-year offtake agreement, with Chestnut providing Microsoft with more than 7 million tons of nature-based carbon removal credits, generated from its forest projects in the Southern U.S.",
            "According to Chestnut, the new agreement with Microsoft will enable it to grow its ARR portfolio to 500,000 acres by 2030 and to remove 100 million tons of CO2 from the atmosphere over a 50-year crediting period.",
            "“We’re excited to be expanding our collaboration with Microsoft given their market leadership in net zero commitments and the signing of a second agreement within the span of a year reaffirms their view that Chestnut is delivering high quality removal credits. We’re confident in our belief that nature-based afforestation solutions are the most attractive, scalable, and cost-effective means for removing carbon from the atmosphere today. We continue to bring high-quality credits to market for discerning customers and look forward to building on our leading position in the market.”",
            "The new transaction adds to an initial 15-year agreement between Microsoft and Chestnut in December 2023 for up to 3 million tons of carbon credits, and marks a further expansion to Microsoft’s diverse portfolio of carbon removal projects, forming part of the tech giant’s initiative to become carbon negative by 2030. The portfolio includes several large-scale reforestation-based agreements, including a 3.5 million ton deal announced earlier this month with Brazil-based re.green, in addition to technologies including, ocean-based carbon removal, and biochar-based projects, and direct air capture (DAC) agreements.",
            "Brian Marrs, Senior Director of Energy & Carbon Removal at Microsoft, said:",
            "“This agreement with Chestnut Carbon is another positive step towards Microsoft’s goal to become carbon negative by 2030. We look forward to the prospect of scaling forest restoration within the United States, attracting sophisticated private capital in the process. We are glad to see the Sustainable Restoration Project diversify the ecological impact of our global carbon removal portfolio.”"
        ],
        "esg_theme_counts":{
            "environmental":22,
            "social":5,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "carbon",
                "green",
                "net zero",
                "conservation",
                "emissions",
                "sustainable"
            ],
            "social":[
                "community",
                "stakeholder"
            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":0.33,
        "sentiment":"positive",
        "positive_words":4,
        "negative_words":2,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"Microsoft Signs Forest Restoration Deal to Remove 3.5 Million Tons of CO2",
        "date":"January 23, 2025",
        "link":"https:\/\/www.esgtoday.com\/microsoft-signs-forest-restoration-deal-to-remove-3-5-million-tons-of-co2\/",
        "excerpt":"Microsoft and nature-based climate solutions startup re.green announced a new agreement, the second between the […]",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"microsoft",
        "categories":[

        ],
        "full_content":"Microsoft and nature-based climate solutions startup re.green announced a new agreement, the second between the companies, expanding their collaboration to restore forests in Brazil to cover an area three times the size of the city of Paris, with Microsoft purchasing carbon removal offtakes from the projects totalling 6.5 million tons.\nMicrosoft and re.green signed their initial agreement in May 2024, to restore areas in the Amazon and Atlantic Forests covering 15,500 hectares, and for the purchase of 3 million tons of carbon removal credits over a 15-year period. The new agreement adds 17,500 hectares to the partnership, and nearly 3.5 million tonnes of carbon removals.\nThiago Picolo, CEO of re.green, said:\n“Signing this second offtake agreement with Microsoft reflects our shared commitment to high-integrity nature-based solutions, with tangible results to date. Restoring these biomes, home to the planet’s richest biodiversity, represents one of the greatest opportunities for large-scale decarbonization. We are thrilled to conclude another agreement with Microsoft, enhancing our impact and reaching new areas.”\nBased in Rio de Janeiro, re.green aims to restore one million hectares of degraded land in the Amazon and Atlantic forests in Brazil, with a goal to capture 15 million tons of carbon per year, in addition to conserving biodiversity, sustainably managing forest products and supporting the empowerment of local communities. The company’s forest restoration process includes selecting degraded lands through internally developed spatial analysis technology, using restoration models based on native and regional species, engaging and training local communities to support the restoration and protection of forests, while generating income and preserving the projects, and actively monitoring forest restoration and recovery, enabling the company to market high-quality carbon credits and forest solutions.\nAccording to the companies, the first agreement initiated last year has already resulted in the planting of more than 4.4 million seedlings spanning 80 native species across 11,000 hectares of degraded or abandoned pasturelands.\nThe new announcement expands the focus of the collaboration to three regions, including the eastern edge of the Amazon Forest Biome, Southern Bahia, at the heart of the central biodiversity corridor of the Atlantic Forest, and Vale do Paraíba, also in the Atlantic Forest, covering its southeast biodiversity corridor.\nIn addition to the carbon removal attributes, the companies highlighted other benefits from the projects, including the reestablishment of the diversity, structure, and function of natural forest ecosystems, increasing habitat for endemic, rare, and threatened species and fostering local development,  as well as social benefits for local communities, with hundreds of people employed in restoration efforts and other related activities.\nThe agreements form part of a rapidly growing series of carbon removal deals by Microsoft, forming part of the tech giant’s initiative to become carbon negative by 2030, including several large-scale nature-based carbon removal agreements, with several focused on forest restoration, in addition to technologies including, ocean-based carbon removal, and biochar-based projects, and direct air capture (DAC) agreements.\nBrian Marrs, Senior Director of Carbon Removal and Energy at Microsoft, said:\n“Microsoft is pleased to expand its collaboration with re.green to continue advancing native-species-led restoration in Brazil. Meeting our 2030 carbon negative target will require tapping into a diverse array of carbon removal pathways, and we are keen to support those nature-based solutions which go beyond sequestering CO2 to simultaneously improve social and ecological outcomes.”",
        "mention_count":8,
        "relevant_paragraphs":[
            "Microsoft and nature-based climate solutions startup re.green announced a new agreement, the second between the companies, expanding their collaboration to restore forests in Brazil to cover an area three times the size of the city of Paris, with Microsoft purchasing carbon removal offtakes from the projects totalling 6.5 million tons.",
            "Microsoft and re.green signed their initial agreement in May 2024, to restore areas in the Amazon and Atlantic Forests covering 15,500 hectares, and for the purchase of 3 million tons of carbon removal credits over a 15-year period. The new agreement adds 17,500 hectares to the partnership, and nearly 3.5 million tonnes of carbon removals.",
            "“Signing this second offtake agreement with Microsoft reflects our shared commitment to high-integrity nature-based solutions, with tangible results to date. Restoring these biomes, home to the planet’s richest biodiversity, represents one of the greatest opportunities for large-scale decarbonization. We are thrilled to conclude another agreement with Microsoft, enhancing our impact and reaching new areas.”",
            "The agreements form part of a rapidly growing series of carbon removal deals by Microsoft, forming part of the tech giant’s initiative to become carbon negative by 2030, including several large-scale nature-based carbon removal agreements, with several focused on forest restoration, in addition to technologies including, ocean-based carbon removal, and biochar-based projects, and direct air capture (DAC) agreements.",
            "Brian Marrs, Senior Director of Carbon Removal and Energy at Microsoft, said:",
            "“Microsoft is pleased to expand its collaboration with re.green to continue advancing native-species-led restoration in Brazil. Meeting our 2030 carbon negative target will require tapping into a diverse array of carbon removal pathways, and we are keen to support those nature-based solutions which go beyond sequestering CO2 to simultaneously improve social and ecological outcomes.”"
        ],
        "esg_theme_counts":{
            "environmental":23,
            "social":1,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "green",
                "carbon",
                "climate",
                "biodiversity"
            ],
            "social":[
                "diversity"
            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":0.0,
        "sentiment":"neutral",
        "positive_words":2,
        "negative_words":2,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"Microsoft Launches New Datacenter Design Avoiding Use of Water for Cooling",
        "date":"December 10, 2024",
        "link":"https:\/\/www.esgtoday.com\/microsoft-launches-new-datacenter-design-avoiding-use-of-water-for-cooling\/",
        "excerpt":"Microsoft announced the launch of a new datacenter design, optimizing AI workloads and avoiding the […]",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"microsoft",
        "categories":[

        ],
        "full_content":"Microsoft announced the launch of a new datacenter design, optimizing AI workloads and avoiding the consumption of water for cooling, supporting the company’s datacenter-focused sustainability goals.\nThe announcement follows the release by Microsoft earlier this year of its “Datacenter Community Pledge,” aimed at ensuring that the company’s growing datacenter footprint serves helps to address societal challenges and create benefits in local communities. The pledge included a commitment  to “design and operate our datacenters to support society’s climate goals and become carbon negative, water positive and zero waste before 2030.”\nDatacenters generate a great deal of heat, and generally use a chilled water circuit to absorb the heat generated by equipment. According to experts, the average mid-sized data center in the US utilizes around 300,000 gallons of water a day – as much as is used by 1,000 US households, making data centers alone among the top ten commercial and industrial users of water in the country.\nMicrosoft said that its new datacenter projects to be built in Phoenix, Arizona, and Mt. Pleasant, Wisconsin, will pilot cooling systems that do not consume water. These new datacenters are the first ones that will be based on new designs that use a next-generation cooling technology that avoids water evaporation, which the company says will save as much as 125 million liters of water per year per datacenter. The new sites will begin coming online in late 2027, Microsoft said, and all new Microsoft datacenter designs have begun using the new cooling technology.\nAccording to Microsoft, the new liquid cooling technologies recycle water through a closed loop. Water is filled into the system when the data center is under construction, and that water will continually circulate between the servers and chillers to dissipate heat without requiring a fresh water supply.\nIn addition to the new cooling design, Microsoft said it has been taking other steps to reduce water usage. Based on its Water Usage Effectiveness (WUE) measurement, its efforts improved water use efficiency in its last fiscal year by 39% over the amount used in FY 2021. Those savings, Microsoft said, were in part fueled by expanded use of alternative water sources, such as reclaimed and recycled water, in data centers in Texas, Washington, California, and Singapore.\nIn a post highlighting the new design, Steve Solomon, Vice President, Datacenter Infrastructure Engineering at Microsoft, said:\n“We have been working since the early 2000s to reduce water use and improved our WUE by 80% since our first generation of datacenters. As water challenges grow more extreme, we know we have more work to do. The shift to the next generation datacenters is expected to help reduce our WUE to near zero for each datacenter employing zero-water evaporation. As our fleet expands over time, this shift will help reduce Microsoft’s fleetwide WUE even further.”",
        "mention_count":10,
        "relevant_paragraphs":[
            "Microsoft announced the launch of a new datacenter design, optimizing AI workloads and avoiding the consumption of water for cooling, supporting the company’s datacenter-focused sustainability goals.",
            "The announcement follows the release by Microsoft earlier this year of its “Datacenter Community Pledge,” aimed at ensuring that the company’s growing datacenter footprint serves helps to address societal challenges and create benefits in local communities. The pledge included a commitment  to “design and operate our datacenters to support society’s climate goals and become carbon negative, water positive and zero waste before 2030.”",
            "Microsoft said that its new datacenter projects to be built in Phoenix, Arizona, and Mt. Pleasant, Wisconsin, will pilot cooling systems that do not consume water. These new datacenters are the first ones that will be based on new designs that use a next-generation cooling technology that avoids water evaporation, which the company says will save as much as 125 million liters of water per year per datacenter. The new sites will begin coming online in late 2027, Microsoft said, and all new Microsoft datacenter designs have begun using the new cooling technology.",
            "According to Microsoft, the new liquid cooling technologies recycle water through a closed loop. Water is filled into the system when the data center is under construction, and that water will continually circulate between the servers and chillers to dissipate heat without requiring a fresh water supply.",
            "In addition to the new cooling design, Microsoft said it has been taking other steps to reduce water usage. Based on its Water Usage Effectiveness (WUE) measurement, its efforts improved water use efficiency in its last fiscal year by 39% over the amount used in FY 2021. Those savings, Microsoft said, were in part fueled by expanded use of alternative water sources, such as reclaimed and recycled water, in data centers in Texas, Washington, California, and Singapore.",
            "In a post highlighting the new design, Steve Solomon, Vice President, Datacenter Infrastructure Engineering at Microsoft, said:",
            "“We have been working since the early 2000s to reduce water use and improved our WUE by 80% since our first generation of datacenters. As water challenges grow more extreme, we know we have more work to do. The shift to the next generation datacenters is expected to help reduce our WUE to near zero for each datacenter employing zero-water evaporation. As our fleet expands over time, this shift will help reduce Microsoft’s fleetwide WUE even further.”"
        ],
        "esg_theme_counts":{
            "environmental":3,
            "social":1,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "carbon",
                "waste",
                "climate"
            ],
            "social":[
                "community"
            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":1.0,
        "sentiment":"positive",
        "positive_words":2,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"Microsoft Replacing Steel, Concrete in New Datacenters with Wood to Cut Carbon Emissions",
        "date":"November 1, 2024",
        "link":"https:\/\/www.esgtoday.com\/microsoft-replacing-steel-concrete-in-new-datacenters-with-wood-to-cut-carbon-emissions\/",
        "excerpt":"Microsoft revealed a series of initiatives aimed at reducing the embodied carbon footprint of its […]",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"microsoft",
        "categories":[

        ],
        "full_content":"Microsoft revealed a series of initiatives aimed at reducing the embodied carbon footprint of its datacenters, including pioneering the use of wood in construction to replace steel and concrete.\nThe new initiatives come as Microsoft looks to address the growing emissions impact of its rapidly expanding datacenter footprints. While Microsoft has set 2030 goals to become carbon negative and to reduce Scope 3 emissions by more than half compared to 2020, the company recently reported that Scope 3 emissions in 2023 were actually more than 30% higher than in 2020, driven by the construction of datacenters, including embodied carbon in building materials as well as hardware components.\nConstruction materials such as steel and concrete are among the most significant sources of greenhouse gas (GHG) emissions, with steel manufacturing and cement production accounting for approximately 7% and 8%, respectively, of global carbon emissions, according to the World Economic Forum (WEF).\nAmong the key initiatives announced by Microsoft is the use of cross-laminated timber (CLT), a lightweight, superstrong and fire-resistant prefabricated wood material in two new datacenters under construction in northern Virginia, that will enable reductions in the use of steel and concrete.\nCLT is produced by gluing together multiple layers of timber stacked in alternate directions, which is then pressed into a solid panel. Typically made of spruce, pine or Douglas fir, CLT is stronger, lighter and more stable than ordinary wood, and the material performs better than steel at high temperatures by developing a layer of char that provides insulation and maintains the integrity of the structure.\nIn the new datacenters, CLT will be used to displace a portion of the thick concrete typically used for flooring and ceilings, resulting in a much lighter building requiring much less steel.\nAccording to Microsoft, the use of CLT in the new datacenters is estimated to reduce embodied carbon for the facilities by 35% compared to conventional steel construction, and by 65% compared to typical precast concrete.\nJim Hanna, who leads sustainability for Microsoft’s datacenter engineering team, said:\n“We have to be system thinkers across the entire value chain of these materials that go into our datacenters and the equipment that supplies our datacenters.”\nAdditional initiatives the company said it is taking to reduce the embodied carbon footprint of its datacenters include updating contract language to include low-carbon requirements for materials and equipment used in datacenter construction, and investments in low-carbon building materials technologies and developers, such as Stegra (formerly H2 Green Steel), Boston Metal, CarbonCure, and Prometheus Materials through the Microsoft Climate Innovation Fund.\nBrandon Middaugh, who manages the Climate Innovation Fund program and strategy, said:\n“Part of the solution is (figuring out) how do you make sure that our suppliers have the enabling technologies they need to develop the green solution.”\nImage source: Microsoft",
        "mention_count":8,
        "relevant_paragraphs":[
            "Microsoft revealed a series of initiatives aimed at reducing the embodied carbon footprint of its datacenters, including pioneering the use of wood in construction to replace steel and concrete.",
            "The new initiatives come as Microsoft looks to address the growing emissions impact of its rapidly expanding datacenter footprints. While Microsoft has set 2030 goals to become carbon negative and to reduce Scope 3 emissions by more than half compared to 2020, the company recently reported that Scope 3 emissions in 2023 were actually more than 30% higher than in 2020, driven by the construction of datacenters, including embodied carbon in building materials as well as hardware components.",
            "Among the key initiatives announced by Microsoft is the use of cross-laminated timber (CLT), a lightweight, superstrong and fire-resistant prefabricated wood material in two new datacenters under construction in northern Virginia, that will enable reductions in the use of steel and concrete.",
            "According to Microsoft, the use of CLT in the new datacenters is estimated to reduce embodied carbon for the facilities by 35% compared to conventional steel construction, and by 65% compared to typical precast concrete.",
            "Jim Hanna, who leads sustainability for Microsoft’s datacenter engineering team, said:",
            "Additional initiatives the company said it is taking to reduce the embodied carbon footprint of its datacenters include updating contract language to include low-carbon requirements for materials and equipment used in datacenter construction, and investments in low-carbon building materials technologies and developers, such as Stegra (formerly H2 Green Steel), Boston Metal, CarbonCure, and Prometheus Materials through the Microsoft Climate Innovation Fund.",
            "Image source: Microsoft"
        ],
        "esg_theme_counts":{
            "environmental":21,
            "social":0,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "carbon",
                "climate",
                "carbon footprint",
                "green",
                "ghg",
                "greenhouse gas",
                "emissions"
            ],
            "social":[

            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":0.33,
        "sentiment":"positive",
        "positive_words":2,
        "negative_words":1,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"ESG Today: Week in Review",
        "date":"March 23, 2025",
        "link":"https:\/\/www.esgtoday.com\/esg-today-week-in-review-207\/",
        "excerpt":"Excerpt not available",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"microsoft",
        "categories":[

        ],
        "full_content":"This week in ESG news: SBTi publishes first draft of new corporate net zero standard; Canada’s new PM cancels consumer carbon tax; Amazon launches service to sell carbon credits to companies; UBS pushes back net zero goals after acquiring Credit Suisse; BlackRock enhances sustainability characteristics for funds ahead of new regulations; global accounting body adds sustainability reporting skills into training standards; new resource launched for companies reporting on sustainability under both CDP and CSRD; EU launches strategy to decarbonize steel and metals industry; CIP raises more than $13 billion for energy transition fund; Nordea wins €800 million decarbonization-focused investment mandate; capital raises for batter tech, clean fuels, AI-powered solar solutions, and more.\nSee below for the highlights of the past week, and get all your ESG news at ESG Today:\nAmazon Launches Carbon Credit Investment Service\nSBTi Releases Initial Draft of New Corporate Net Zero Standard\nNordea Signs 68,000 Tonne Carbon Removal Agreement\nUBS Pushes Back Net Zero Target by 10 Years Following Credit Suisse Acquisition\nCDP, EFRAG Release Mapping Connecting CDP Disclosures with CSRD Climate Reporting Standards\nIFAC Adds Sustainability Reporting Skills into Training Standards for New Accountants\nGuest Post – Transforming Reporting into Strategy: Navigating Europe’s Omnibus Package\nEU Launches Series of Actions and Investments to Decarbonize Steel, Metal Sectors\nAustralia Court Fines Active Super A$10.5 Million for Greenwashing ESG Investing Claims\nCarney Eliminates Canada’s Consumer Carbon Tax\nNasdaq-backed Carbon Credit Platform Puro.earth Passes 1 Million Tonne Carbon Removal Milestone\nApave Acquires Carbon Accounting Platform Aktio\nLRQA Acquires Energy Transition Consulting Firm EcoEngineers\nUpright Launches 50,000 Company Double Materiality Assessment Database\nArcmont Secures €475 Million Investment Mandates from APG, TIAA for New Impact Lending Strategy\nNeste Issues €700 Million Green Bond to Scale Renewable Fuels Production\nCleantech Startup C1 Raises $22 Million to Replace Fossil Fuels in Shipping, Aviation and Chemicals\nPulsetrain Raises €6.1 Million for Solution to Extend EV Battery Life up to 80%\nCoreshell Raises $24 Million to Scale Low-Cost Silicon EV Batteries\nTerabase Raises $130 Million for Robotics Technology to Scale Deployment of Solar Power Plants\nCIP Raises Over $13 Billion for Energy Transition Infrastructure Fund\nNordea Awarded €800 Million Decarbonization-Focused Equity Mandate by Ircantec\nBlackRock Enhances Sustainability Characteristics of $92 Billion of Funds Ahead of ESMA ESG Fund Naming Rules\nMicrosoft, CalSTRS Back $175 Million Natural Climate Solutions Strategy by Just Climate",
        "mention_count":1,
        "relevant_paragraphs":[
            "Microsoft, CalSTRS Back $175 Million Natural Climate Solutions Strategy by Just Climate"
        ],
        "esg_theme_counts":{
            "environmental":17,
            "social":1,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "carbon",
                "climate",
                "green",
                "net zero",
                "renewable"
            ],
            "social":[
                "equity"
            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":2,
        "sustainable_finance_keywords":[
            "green bond",
            "esg fund"
        ],
        "sustainable_finance_focus":false,
        "sentiment_score":-1.0,
        "sentiment":"negative",
        "positive_words":0,
        "negative_words":1,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"Cleantech Startup C1 Raises $22 Million to Replace Fossil Fuels in Shipping, Aviation and Chemicals",
        "date":"March 21, 2025",
        "link":"https:\/\/www.esgtoday.com\/cleantech-startup-c1-raises-22-million-to-replace-fossil-fuels-in-shipping-aviation-and-chemical-sectors\/",
        "excerpt":"Excerpt not available",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"microsoft",
        "categories":[

        ],
        "full_content":"Berlin-based cleantech startup C1 Green Chemicals announced that it has raised €20 million (USD$21.7 million), with proceeds from the financing aimed at commercializing its green methanol technology and help move emissions-intensive sectors away from fossil feedstocks.\nFounded in 2022, C1 develops new, climate-friendly chemical processes, exclusively on the basis of renewable raw materials and energy, designed with the help of quantum chemical simulations, and implemented in proprietary production technologies. The company has developed a new proprietary process for the production of high-purity green methanol, using decentralized, non-fossil feedstock, low pressures, and low temperatures, enabling mass production at a competitive cost, and providing a solution to replace fossil resources in the shipping, aviation and chemical industries.\nThe company said that it will use the new capital to build a demonstration plant for its methanol production solution, with construction scheduled to begin this year.\nChristian Vollmann, CEO of C1 Green Chemicals AG, said:\n“Two ingredients are crucial for the successful commercialization of scientific innovation: talent and capital. We are delighted that we at C1 have excellent access to both ingredients.”\nOf the total capital raised, €15 million came from investors led by denkapparat, the family office of the founders of German software firm Think-Cell, Markus Hannebauer and Arno Schödl. Planet A Ventures, Maersk Growth, SquareOne, former Linde CEO Wolfgang Reitzle and Siemens Chairman Jim Hagemann Snabe also took part in the funding round, and another €5 million came from approved research grants.\nHannebauer said:\n“At C1, everything comes together perfectly: Cutting-edge research targeting an ecologically and commercially significant problem, pragmatic founders with a clear vision, and a team boasting impressive technological and commercial expertise. This is exactly the profile we are looking for as entrepreneurial investors. It was immediately clear that we would take the lead in this round.”",
        "mention_count":0,
        "relevant_paragraphs":[

        ],
        "esg_theme_counts":{
            "environmental":7,
            "social":0,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "renewable",
                "emissions",
                "green",
                "climate"
            ],
            "social":[

            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":0.0,
        "sentiment":"neutral",
        "positive_words":0,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"Nasdaq-backed Carbon Credit Platform Puro.earth Passes 1 Million Tonne Carbon Removal Milestone",
        "date":"March 21, 2025",
        "link":"https:\/\/www.esgtoday.com\/nasdaq-backed-carbon-credit-platform-puro-earth-passes-1-million-tonne-carbon-removal-milestone\/",
        "excerpt":"Excerpt not available",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"microsoft",
        "categories":[

        ],
        "full_content":"Carbon-crediting platform Puro.earth announced that it has achieved the issuance of more than 1 million CO2 removal certificates – representing more than 1 million tonnes of verified carbon removal – following a significant acceleration in the market over the past several months.\nFounded in 2018, and acquired by Nasdaq in 2021, Puro.earth provides a platform bringing together suppliers of carbon net-negative technologies and companies looking to reduce or counter their carbon footprints. Through Puro.earth’s platform, and based on its carbon credit methodologies, suppliers that remove CO2 from the atmosphere to durable storage of at least 100 years are certified and issued CO2 Removal Certificates (CORCs) into the Puro Registry, which can then be purchased by companies.\nPuro.earth said that it took nearly five years from its first CORCs issuances in 2019 to reach 500,000 issued CORCs in Q1 2024, with growth growing exponentially to reach 1 million CORCs only one year later.\nThe company added that it is on track for issuance of the next million CORCs before the end of H1 2026.\nPuro.earth President Jan-Willem Bode said:\n“Reaching one million of CO₂ removals is just the beginning—our goal is to continue to use our expertise and track record to deliver proven, scalable and high-quality carbon removal credits. The next million is already within reach, and we will continue to ensure that businesses worldwide have access to trusted, verifiable carbon removal credits, at scale.”\nBy methodology, Puro.earth said that Geologically Stored Carbon (GSC)– such as Direct Air Capture Carbon and Storage (DACCS) and Bio Energy Carbon Capture and Storage (BECCS) – and Biochar, have been particularly popular with buyers, each representing more than 34% of issuances, as they offer scalable, high-impact solutions for carbon removal with well-defined processes and measurable outcomes. By location, the U.S. leads issuances by a wide margin, at 45%, followed by Finland at 9.9%, Bolivia at 9.6% and Brazil at 9.2%., with other strong markets including Austria, Norway, and the UK.\nPuro.earth attributed shifting buyer sentiment as a key factor in the sector’s growth, noting buyers such as Microsoft, Google, and the Frontier Buyers that have led in the development of the early-stage durable CDR market, allowing technologies and suppliers to scale. It added that the market is seeing increased interest from buyers in hard-to-abate sectors, such as aviation, concrete, steel manufacturing, shipping, and chemical production.\nAntti Vihavainen, Vice Chairman of Puro.earth, said:\n“We want to thank the key players that have come together to build the CDR market with us: the courageous investors who ventured into the unknown, the pioneering entrepreneurs who chose innovation over business-as-usual, and the forward-thinking buyers whose commitments make everything move.”",
        "mention_count":1,
        "relevant_paragraphs":[
            "Puro.earth attributed shifting buyer sentiment as a key factor in the sector’s growth, noting buyers such as Microsoft, Google, and the Frontier Buyers that have led in the development of the early-stage durable CDR market, allowing technologies and suppliers to scale. It added that the market is seeing increased interest from buyers in hard-to-abate sectors, such as aviation, concrete, steel manufacturing, shipping, and chemical production."
        ],
        "esg_theme_counts":{
            "environmental":11,
            "social":0,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "carbon"
            ],
            "social":[

            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":1.0,
        "sentiment":"positive",
        "positive_words":2,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"Apave Acquires Carbon Accounting Platform Aktio",
        "date":"March 20, 2025",
        "link":"https:\/\/www.esgtoday.com\/apave-acquires-carbon-accounting-platform-aktio\/",
        "excerpt":"Excerpt not available",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"microsoft",
        "categories":[

        ],
        "full_content":"Risk management services provider Apave Group announced the acquisition of French carbon accounting firm Aktio, in a move aimed at helping Apave to strengthen its expertise in sustainability and decarbonization.\nFounded in 2020, Paris-based Aktio provides climate consulting services and greenhouse gas accounting and management software solutions aimed at supporting companies in their low-carbon transition. The company’s platform supports companies in measuring their carbon footprint, setting climate targets and defining a low-carbon trajectory, implementing decarbonization plans, complying with regulations such as CSRD, and communicating and training on the low-carbon transition approach.\nSince launching, Aktio has grown to approximately 40 experts, climate consultants and web developers, and has supported 500 organizations in addressing their decarbonization challenges.\nAktio co-founders Laurent Barbezieux, Alex Huyn and Thibault Faninger said:\n“At a time when the risks and consequences of climate change are intensifying, it is more essential than ever to democratize the low-carbon transition as quickly as possible. Joining the Apave Group, a leading player in environmental consulting and auditing, is an exceptional acceleration opportunity for Aktio, to equip, train and support the carbon accountants of tomorrow.”\nAccording to Apave, the acquisition will help strengthen its ‘Green & Social’ range of services, which aimsto support the success of their clients’ transition plans across areas including energy transition, climate transition, and social and societal transition. Apave’s benchmark entity in terms of sustainability will be the newly formed Aktio-Apave, formed by combining Aktio’s experts and consultants and the experts and consultants from Apave’s ‘Climate and Sustainability’ department.\nPhilippe Maillard, CEO of the Apave Group, said:\n“Today, we are taking a new step with the acquisition of Aktio, fully in line with our corporate purpose: ‘To act as a trusted partner to make the world safer, more sustainable and a source of shared progress.’ We are thus accelerating our desire to be able to support our clients even more and better in their sustainable performance objectives, whether these relate to technical, human, environmental, digital or climate issues.”",
        "mention_count":0,
        "relevant_paragraphs":[

        ],
        "esg_theme_counts":{
            "environmental":19,
            "social":0,
            "governance":1
        },
        "esg_keywords":{
            "environmental":[
                "carbon",
                "climate",
                "carbon footprint",
                "green",
                "greenhouse gas",
                "sustainable"
            ],
            "social":[

            ],
            "governance":[
                "risk management"
            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":1.0,
        "sentiment":"positive",
        "positive_words":3,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"Nordea Awarded €800 Million Decarbonization-Focused Equity Mandate by Ircantec",
        "date":"March 20, 2025",
        "link":"https:\/\/www.esgtoday.com\/nordea-awarded-e800-million-decarbonization-focused-equity-mandate-by-ircantec\/",
        "excerpt":"Excerpt not available",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"microsoft",
        "categories":[

        ],
        "full_content":"Northern Europe-based asset manager Nordea Asset Management announced that it has been selected to help manage a €800 million (USD$867 million) decarbonization-focused global equity investment mandate for French pension plan Iracantec, in partnership with Paris-based asset management firm ODDO BHF AM.\nIrcantec is a French complementary pension scheme with more than €17 billion (USD $18.4 billion) invested in the financial markets. The organization announced a series of commitments in 2021 aimed at ensuring that its reserves are on course to ensure emissions reductions compatible with a 1.5°C scenario. Ircantec’s sustainable investment initiatives include a strategy to phase out fossil fuels by 2030, and a target of reducing emissions from its portfolio of companies by 7% per year on average until 2050.\nThe new mandate will utilize a customized active global equity solution based on Nordea’s BetaPlus Responsible Enhanced Equities Strategies, and will use Nordea’s proprietary decarbonization tools to track companies’ progress towards net zero, helping Ircantec achieve its 7% annual CO2 reduction goal. The mandate will be managed by Nordea’s Multi Assets Team.\nChristophe Girondel, Global Head of Institutional and Wholesale Distribution at Nordea Asset Management, said:\n“We are grateful for Ircantec’s trust in our longstanding BetaPlus capabilities, and we look forward to helping them progress toward a low-carbon future. The opportunity to support Ircantec in reaching their decarbonization target underscores our commitment to aligning climate objectives with investment performance.”",
        "mention_count":0,
        "relevant_paragraphs":[

        ],
        "esg_theme_counts":{
            "environmental":6,
            "social":2,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "carbon",
                "climate",
                "net zero",
                "emissions",
                "sustainable"
            ],
            "social":[
                "equity"
            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":1.0,
        "sentiment":"positive",
        "positive_words":8,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"Nordea Signs 68,000 Tonne Carbon Removal Agreement",
        "date":"March 18, 2025",
        "link":"https:\/\/www.esgtoday.com\/nordea-signs-68000-tonne-carbon-removal-agreement\/",
        "excerpt":"Excerpt not available",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"microsoft",
        "categories":[

        ],
        "full_content":"Northern Europe-based financial services company Nordea announced that it has signed a deal with Norwegian startup Inherit Carbon Solutions to remove at least 68,000 tonnes of carbon dioxide from the atmosphere, providing carbon removal credits to the bank starting next year.\nThis multi-year contract is the first of what the bank says will be a portfolio of agreements with companies working on carbon removal projects. Under the agreement, Inherit will implement its system to capture CO2 from a biogas plant in Denmark. Once captured, the CO2 will be liquified and transported for geological storage under the North Sea.\nNordea announced a commitment in 2021 to become a net zero bank by 2050, along with a series of interim 2030 targets including reductions in carbon emissions from lending and investment portfolios by 40-50%, reductions in internal carbon emissions by at least 50% and the achievement of net positive carbon contribution.\nThe firm said that by the end of 2024, it had reduced emissions from its own operations by 53% compared with 2019, and with its goal to achieve net positive carbon contribution by 2030, it aims for the amount of high-quality carbon removal credits to exceed the unabated emissions from its own operations.\nPeter Sandahl, Head of Climate & Environment at Nordea said:\n“This agreement is a milestone in Nordea’s new carbon removal strategy and reflects our ambition to support the scaling of high-quality carbon removal technologies. . .Through this commitment we are accelerating our operational sustainability efforts and, in addition, supporting the scaling of innovative solutions essential to reach long-term climate goals and keeping global warming within the boundaries of the Paris Agreement.”\nFounded in 2021, Oslo, Norway-based Inherit captures and permanently stores CO2 released from production of renewable natural gas (RNG), which is produced from organic waste, such as agricultural, industrial, and household wastes. Unlike other carbon removal solutions, CO2 captured from RNG production doesn’t have to be separated from other materials as It is created during the production of RNG, which does not contribute to climate change and is used as a fuel in the Nordics and elsewhere. After capturing carbon from biogas plants, Inherit liquifies the CO2 and transports it for permanent geological storage.\nKaja Voss, Co-CEO of Inherit, said:\n“We are excited to partner with Nordea on this groundbreaking project and to see that Nordea goes to such great lengths to accelerate the carbon removal industry. Together, we’re taking an important step towards a net zero future, and we look forward to this collaboration going forward.”",
        "mention_count":0,
        "relevant_paragraphs":[

        ],
        "esg_theme_counts":{
            "environmental":26,
            "social":0,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "carbon",
                "climate",
                "net zero",
                "renewable",
                "environment",
                "waste",
                "emissions"
            ],
            "social":[

            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":1.0,
        "sentiment":"positive",
        "positive_words":5,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"UBS Pushes Back Net Zero Target by 10 Years Following Credit Suisse Acquisition",
        "date":"March 18, 2025",
        "link":"https:\/\/www.esgtoday.com\/ubs-pushes-back-net-zero-target-by-10-years-following-credit-suisse-acquisition\/",
        "excerpt":"Excerpt not available",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"microsoft",
        "categories":[

        ],
        "full_content":"UBS revealed in its 2024 Sustainability Report that it has pushed back its target to achieve net zero greenhouse gas (GHG) emissions in its operations by 10 years to 2035, from its prior 2025 goal, attributing the change largely due to the effect of the bank’s acquisition of Credit Suisse.\nThe bank also withdrew a target for its Asset Management division to align 20% of its assets under management (AUM) with net zero by 2030, saying that it is reviewing the goal due to the integration of Credit Suisse.\nThe announcement by UBS marks the latest in a series of moves by banks globally to withdraw or pull back on climate commitments, although UBS’ changes appear less drastic than those by some of its peers. HSBC, for example, recently pushed back its own target to achieve net zero emissions in its operations and supply chain by 20 years to 2050, and placed its interim financed emissions targets under review, all major U.S., Canadian and some other banks have left the Net-Zero Banking Alliance, and Wells Fargo entirely dropped its target to achieve net zero financed emissions by 2050, and its sector-specific 2030 interim financed emissions targets.\nUBS remains a member of the NZBA, and in its report, the bank confirmed that it remains committed to its financed emissions decarbonization targets. UBS has 2030 financed emissions goals in place for the Swiss residential and commercial real estate, power generation, iron and steel, cement, and fossil fuel sectors.\nThe report, however, changed language on UBS’ key climate commitments from its 2023 report, in which the bank said that “by 2050, our ambition is to achieve net-zero greenhouse gas emissions across our scope 1 and 2, and specified scope 3 activities,” updating it with “by 2050, the global economy aims to transition to net zero. For example, across our own operations (scopes 1 and 2), UBS plans to achieve net zero by 2035, well ahead of 2050,” and outlining its Scope 3 goal as “addressing our financed emissions by aligning specified sectors to decarbonization pathways.”\nUBS attributed the change in its operational net zero goal to its “enlarged corporate real estate portfolio following the acquisition of the Credit Suisse Group,” as well as to “the latest definition of a “net-zero target” in the Corporate Sustainability Reporting Directive (CSRD).”\nAlongside the updated net zero target, UBS also set out a new interim goal to reduce Scope 1 and 2 emissions by 57% by 2030, on a 2023 baseline, as well as a commitment to source 100% of electricity from renewable-source-qualifying generation by 2026. For the 2035 net zero target, UBS said that it aims to reduce emissions by at least 90% before neutralizing any residual emissions through the purchase of carbon removal credits, while the interim 2030 goal does not include the use of any carbon removal credits.\nIn its Asset Management business, UBS said that it withdrew its 2030 target as it is “reviewing the legacy target set prior to the acquisition of the Credit Suisse Group, taking into account all of the AuM of the combined businesses.” In the report, UBS said that its assets under management with a net zero ambition reached $64.4 billion, or 3.6% of AUM (including Credit Suisse AUM), up from $35.5 billion and 2.9% of AUM in 2023 (excluding Credit Suisse AUM).",
        "mention_count":0,
        "relevant_paragraphs":[

        ],
        "esg_theme_counts":{
            "environmental":30,
            "social":0,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "carbon",
                "climate",
                "net zero",
                "ghg",
                "renewable",
                "greenhouse gas",
                "emissions"
            ],
            "social":[

            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":1.0,
        "sentiment":"positive",
        "positive_words":6,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"Neste Issues €700 Million Green Bond to Scale Renewable Fuels Production",
        "date":"March 17, 2025",
        "link":"https:\/\/www.esgtoday.com\/neste-issues-e700-million-green-bond-to-scale-renewable-fuels-production\/",
        "excerpt":"Excerpt not available",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"microsoft",
        "categories":[

        ],
        "full_content":"Sustainable fuel producer Neste announced that it has raised €700 million (USD$765 million) in a green bond offering, with proceeds aimed at supporting the expansion of its Rotterdam refinery, set to become the largest renewable diesel and sustainable aviation fuel (SAF) facility in the world, according to the company.\nFinland Neste provides renewable and circular solutions for sectors including road transport, aviation, and polymers and chemicals. The company’s products include Neste MY Sustainable Aviation Fuel, made from sustainably sourced renewable waste and residues such as used cooking oil and animal fat waste, and compatible with existing aircraft engines and airport fuel infrastructure, and Neste MY Renewable Diesel, produced from renewable raw materials using a hydrogen treatment process, that can be used as a drop-in replacement to fossil diesel, to significantly reduce GHG emissions.\nThe company’s Rotterdam refinery started producing renewable products in 2011, and has a current capacity of 1.4 million tons. Neste is undertaking a €1.9 billion expansion of the refinery, aimed at expanding its annual renewable product capacity to 2.7 million tons, which would include 1.2 million tons of sustainable aviation fuel, with a target to start up the new production unit in 2026. Neste recently signed a deal with DHL to provide the logistics giant with 300,000 tons of unblended SAF per year by 2030.\nAnssi Tammilehto, Interim CFO of Neste, said:\n“The recent development in the renewables market has been challenging, but we have a clear plan forward. We are pleased to see strong participation from high-quality investors in this new issue. The net proceeds from this Green Bond are expected to be steered towards our expansion of the Rotterdam refinery, which is expected to become the world’s largest renewable diesel and sustainable aviation fuel facility.”\nThe new 5-year green bond will pay a fixed coupon of 3.75%.",
        "mention_count":0,
        "relevant_paragraphs":[

        ],
        "esg_theme_counts":{
            "environmental":20,
            "social":0,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "green",
                "ghg",
                "renewable",
                "waste",
                "emissions",
                "sustainable"
            ],
            "social":[

            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":3,
        "sustainable_finance_keywords":[
            "green bond"
        ],
        "sustainable_finance_focus":false,
        "sentiment_score":1.0,
        "sentiment":"positive",
        "positive_words":4,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"BNP Paribas AM Establishes €800 Million Venture and Impact Platform",
        "date":"March 12, 2025",
        "link":"https:\/\/www.esgtoday.com\/bnp-paribas-am-launches-e800-million-venture-and-impact-platform\/",
        "excerpt":"Excerpt not available",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"microsoft",
        "categories":[

        ],
        "full_content":"BNP Paribas Asset Management (BNPP AM) announced the creation of a new entity, the Venture and Impact platform, within its Private Assets division.\nLaunched with €800 million (USD$879 million) in assets under management, and dedicated to innovation and venture capital, the new platform combines the activities of BNPP AM’s Ecological Transition and Impact, Fintech and the Solar Impulse Venture Fund.\nThe Venture and Impact platform is led by Yann Lagalaye. Lagalaye has been serving as Head of Ecological Transition & Impact, managing the BNPP Agility Capital team in charge of the Solar Impulse Venture Fund, as well as the BNP Paribas Principal Investment teams in charge of the Ecological Transition Capital venture capital investment line and the Impact investment line dedicated to impact fund, project or small cap with a focused on natural capital and local development.\nAs part of the reorganization, the firm also announced the appointment of Marinus Oosterbeek and Vincent Baillin as Managing Directors at Opera Tech Ventures (OTV), BNP Paribas Group’s venture capital fund dedicated to the transformation of the financial industry.\nLagalaye said:\n“I would like to congratulate Marinus and Vincent on their appointment as Managing Directors. This promotion demonstrates the trust of BNP Paribas Group in their expertise and their ability to accelerate the development of the fund, which plays a key role in the Group’s digital transformation strategy. By positioning OTV within Private Assets’ Venture & Impact platform, we are committed to the growth of a dedicated innovation and venture capital team.”",
        "mention_count":0,
        "relevant_paragraphs":[

        ],
        "esg_theme_counts":{
            "environmental":0,
            "social":0,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[

            ],
            "social":[

            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"undetermined",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":1.0,
        "sentiment":"positive",
        "positive_words":4,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"EU Launches Series of Actions and Investments to Decarbonize Steel, Metal Sectors",
        "date":"March 20, 2025",
        "link":"https:\/\/www.esgtoday.com\/eu-launches-series-of-actions-and-investments-to-decarbonize-steel-metal-sectors\/",
        "excerpt":"Excerpt not available",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"microsoft",
        "categories":[

        ],
        "full_content":"The European Commission announced the launch of its Action Plan on Steel and Metals, outlining a broad range of initiatives aimed at protecting and strengthening the industry’s competitiveness, and supporting its decarbonization.\nAccording to the Commission, the new Action Plan comes as the European steel and metals industry faces a series of challenges, including high energy costs, and unfair global competition, as well as a need for investments to reduce greenhouse gas emissions, with the sector being one of the EU’s largest industrial emitters. The plan focuses on six key pillars, including ensuring access to clean and affordable energy, preventing carbon leakage, strengthening European industrial capacities, promoting circularity for metals, defending quality industrial jobs, and de-risking projects through lead markets and public support.\nThe release marks the second Action Plan, after one focused on the automotive sector, to be launched by the Commission under its new “Competitiveness Compass” roadmap to boost Europe’s productivity and global competitiveness. The roadmap included plans to introduce in 2025 “tailor-made action plans” for key energy-intensive industries, as well as plans for initiatives including a proposed “Industrial Decarbonisation Accelerator Act” targeting streamlined permitting for renewable energy for emissions-intensive sectors, and a review of the Carbon Border Adjustment Mechanism (CBAM).\nWithin the pillars focused on sector decarbonization, the Commission unveiled a series of initiatives and plans aimed at boosting the industry’s access to and use of clean energy, promoting investment in clean technologies, and de-risking emissions reduction investments for companies.\nKey actions to increase the use of clean energy include promoting the use of Power Purchase Agreements (PPAs), encouraging member states to reduce network tariffs to alleviate electricity price volatility, promoting faster grid access and supporting the increased use of renewable and low-carbon hydrogen.\nSustainability-focused funding and incentives highlighted by the plan include plans to mobilize €100 billion in funding at scale-up stage through the “Industrial Decarbonisation Bank” announced in February in the Clean Industrial Deal, starting with a €1 billion pilot auction in 2025 focusing on decarbonizing and electrifying key industrial processes.\nThe Action Plan also aims to implement measures to address “carbon leakage” in the sector, a situation in which companies move production of emissions intensive goods to countries with less stringent environmental and climate policies, through revisions to the Carbon Border Adjustment Mechanism (CBAM), the EU’s carbon tax on imported goods. Plans include introducing a legislative proposal later this year to extend the scope of CBAM to certain steel and aluminium-based downstream products and to include additional anti-circumvention measures.\nAdditionally, the Action Plan includes a series of actions aimed at boosting circularity in the metals industry, including plans to set targets for recycled steel and aluminium in key sectors, assessing whether products such as construction materials and electronics should have recycling or recycled content requirements, and considering trade measures on metal scrap to ensure sufficient availability of scrap.\nEuropean Commission President Ursula von der Leyen said:\n“The steel industry has always been a core engine for European prosperity. Next-generation, clean steel should therefore continue to be manufactured in Europe. That means we have to help our steelmakers who are facing strong headwinds on the global market. To make sure they remain competitive, we must reduce energy costs and help them introduce innovative, low-carbon technologies to the market. With today’s Action Plan we are offering concrete solutions for a thriving European steel industry.”",
        "mention_count":0,
        "relevant_paragraphs":[

        ],
        "esg_theme_counts":{
            "environmental":16,
            "social":0,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "carbon",
                "climate",
                "renewable",
                "recycling",
                "greenhouse gas",
                "emissions"
            ],
            "social":[

            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":1.0,
        "sentiment":"positive",
        "positive_words":1,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"Carney Eliminates Canada’s Consumer Carbon Tax",
        "date":"March 17, 2025",
        "link":"https:\/\/www.esgtoday.com\/carney-eliminates-canadas-consumer-carbon-tax\/",
        "excerpt":"Excerpt not available",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"microsoft",
        "categories":[

        ],
        "full_content":"In his first act as Canada’s new Prime Minister, Mark Carney signed an order on Friday eliminating a controversial consumer carbon tax, the “fuel charge,” effective April 1, 2025.\nIntroduced in 2019, the fuel charge aimed to introduce a price on carbon for businesses and consumers in order to incentivize emissions reductions and to adopt cleaner technologies and products. The carbon tax started at $20 per tonne in 2019, and has been increasing annually, and was set to reach $170 per tonne in 2030.\nThe elimination of the fuel charge follows a campaign by Canada’s Conservative Leader Pierre Poilievre over the past several months against the carbon tax, as consumers faced high inflation. Despite championing the carbon tax in the past, Carney’s campaign for Liberal party leadership acknowledged that it “isn’t working and has become too divisive,” and pledged to cancel it.\nCarney takes the office of Prime Minister with a strong resume in both finance and climate action. He has served as the Governor of the both the Banks of Canada and of England, as the UN Special Envoy for Climate Action and Finance, as the UK Prime Minister’s Finance Adviser for the COP26 UN Climate Change Conference, and as co-Chair of the Glasgow Financial Alliance for Net Zero (GFANZ). Prior to running for Liberal leadership, he was serving as Chair and Head of Transition Investing at Brookfield Asset Management, focused on ESG investing.\nWhile the consumer carbon tax will be ending, the carbon price on businesses will remain in place. In his leadership campaign, Carney pledged to ensure that “Canada’s biggest emitters will contribute their fair share,” with a plan to tighten the Output-Based Pricing System (OBPS) for large, industrial emitters, and to introduce a Carbon Border Adjustment Mechanism (CBAM), or a carbon tax on imports designed to prevent “carbon leakage,” a situation in which companies move production of emissions intensive goods to countries with less stringent environmental and climate policies. Carney also pledged to introduce incentives for green buildings and transport electrification, and for consumer investments such as home retrofits and heat pump installations.\nIn a presentation announcing the elimination of the consumer carbon tax, Carney said:\n“This will make a difference to hard-pressed Canadians, but it is part of a much bigger set of measures that this government is taking to ensure that we fight against climate change, that our companies are competitive, and the country moves forward.”",
        "mention_count":0,
        "relevant_paragraphs":[

        ],
        "esg_theme_counts":{
            "environmental":20,
            "social":0,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "carbon",
                "climate",
                "green",
                "net zero",
                "emissions"
            ],
            "social":[

            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":1.0,
        "sentiment":"positive",
        "positive_words":2,
        "negative_words":0,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"Senate Republicans Launch Legislation to Shield U.S. Companies from EU Sustainability Due Diligence Rules",
        "date":"March 13, 2025",
        "link":"https:\/\/www.esgtoday.com\/senate-republicans-launch-legislation-to-shield-u-s-companies-from-eu-sustainability-due-diligence-rules\/",
        "excerpt":"Excerpt not available",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"microsoft",
        "categories":[

        ],
        "full_content":"U.S. Senator and Senate Banking Committee member Bill Hagerty announced the introduction of the “PROTECT USA” Act, proposing new legislation aimed at shielding U.S. companies from having to comply with the EU’s Corporate Sustainability Due Diligence Directive (CSDDD).\nThe CSDDD sets out obligations for companies to identify, assess, prevent, mitigate, address and remedy impacts on people and planet – ranging from child labor and slavery to pollution and emissions, deforestation and damage to ecosystems – in their upstream supply chain and some downstream activities such as distribution and recycling.\nThe legislation was adopted in May 2024, but as part of the European Commission’s Omnibus process faces proposed changes, including a delay to its implementation, and a narrower scope to require companies to only perform sustainability due diligence at the level of direct business partners.\nUnder the new proposed U.S. legislation, U.S. companies in several sectors including agriculture, mining, energy, timber, and manufacturing would be prohibited from being forced to comply with the CSDDD or any foreign sustainability due diligence regulation, judgements by foreign courts in relation to such regulation would not be recognized. The proposal would also block any adverse actions taken against companies in relation to the regulations.\nSenator Hagerty said:\n“American companies should be governed by U.S. laws, not unaccountable lawmakers in foreign capitals. The European Union’s ideologically motivated regulatory overreach is an affront to U.S. sovereignty. I will use every tool at my disposal to block it.”\nThe introduction of the legislation follows the publication of a letter by the Senate Banking Committee Chairman to Trump administration officials in February expressing concerns about the potential impact of the EU’s CSDDD regulation on U.S. companies, and urging the administration to “engage with European counterparts to vocalize direct opposition and encourage an indefinite pause on its implementation.”",
        "mention_count":0,
        "relevant_paragraphs":[

        ],
        "esg_theme_counts":{
            "environmental":3,
            "social":1,
            "governance":1
        },
        "esg_keywords":{
            "environmental":[
                "emissions",
                "recycling",
                "pollution"
            ],
            "social":[
                "labor"
            ],
            "governance":[
                "regulatory"
            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":-1.0,
        "sentiment":"negative",
        "positive_words":0,
        "negative_words":1,
        "quotes":[

        ],
        "quote_count":0
    },
    {
        "title":"UK Plans Levy on Jet Fuel Producers to Fund Sustainable Aviation Fuel “Revenue Certainty Mechanism”",
        "date":"March 10, 2025",
        "link":"https:\/\/www.esgtoday.com\/uk-plans-levy-on-jet-fuel-producers-to-fund-revenue-certainty-mechanism-for-sustainable-aviation-fuel-development\/",
        "excerpt":"Excerpt not available",
        "source":"ESG Today",
        "search_method":"direct_search",
        "company":"microsoft",
        "categories":[

        ],
        "full_content":"The UK Government’s Department for Transport announced the launch of a new consultation on an initiative aimed at supporting producers of sustainable aviation fuel (SAF) through the establishment of a “revenue certainty mechanism” (RCM) to be funded by jet-fuel suppliers.\nFuel accounts for the vast majority of the aviation sector’s emissions. Generally produced from sustainable resources, like waste oils and agricultural residues, SAF is seen as one of the key tools to help decarbonize the aviation industry in the near- to medium-term. SAF producers estimate the fuels can result in lifecycle GHG emissions reductions of as much as 85% relative to conventional fuels.\nThe new consultation follows the launch in January by the government of the SAF Mandate, requiring the introduction of sustainable aviation fuel (SAF) in the UK’s jet fuel mix, starting at 2% in 2025, and ramping up to 22% by 2040.\nEfforts to meaningfully increase the use of SAF by airlines face significant challenges, including the low supply currently available on the market, and prices well above those of conventional fossil-based fuels.\nAmong the key barriers to ramping up SAF production is the high start-up cost, with the government estimating investments of £600 million to £2 billion for new commercial plants to reach economies of scale, with new plants struggling to secure investments due to risks such as revenue uncertainty and fluctuating fuel prices.\nAccording to the Department for Transport, the new RCM plan will help to reduce risk by introducing an industry funded price guarantee to ensure steady income flow for producers, even if SAF prices fluctuate, and giving investors confidence to invest in SAF plants in the UK.\nThe consultation outlines the government’s position that the RCM should be funded by industry, with a preferred approach to introduce a variable levy on suppliers of jet fuel. The proposal follows the “polluter pays principle” for hard to abate sectors, and is consistent with existing schemes for renewable electricity and hydrogen. The government stated that the mechanism allows the cost to be spread across the supply chain, ensuring that it is borne by those benefiting from the supply of fossil aviation fuel.\nAviation Minister, Mike Kane, said:\n“We are committed to building the technology and fuel supply that will see greener flying become a reality in a way that protects consumers.\n“As part of our Plan for Change, these proposals will power up SAF production in the UK, support thousands of green jobs and bolster expansion plans.”\nThe consultation will run until the end of March, with plans for a Sustainable Aviation Fuel (Revenue Support Mechanism) Bill to be brought to Parliament in the Spring. Click here to access the consultation.",
        "mention_count":0,
        "relevant_paragraphs":[

        ],
        "esg_theme_counts":{
            "environmental":10,
            "social":0,
            "governance":0
        },
        "esg_keywords":{
            "environmental":[
                "green",
                "ghg",
                "renewable",
                "waste",
                "emissions",
                "sustainable"
            ],
            "social":[

            ],
            "governance":[

            ]
        },
        "primary_esg_focus":"environmental",
        "sustainable_finance_mentions":0,
        "sustainable_finance_keywords":[

        ],
        "sustainable_finance_focus":false,
        "sentiment_score":0.6,
        "sentiment":"positive",
        "positive_words":4,
        "negative_words":1,
        "quotes":[

        ],
        "quote_count":0
    }
]